[
  "Is it true that cannibals don't eat clowns because they taste funny?",
  "What kind of pig can you ignore at a party? A wild bore.",
  "What kind of murderer has fiber? A cereal killer.",
  "A man walking down the streets sees another man with a very big dog. One man says \nto the other, \"Does your dog bite\", the man replies \"No my dog doesn't\" The man pats the dog \nand has his hand bitten off, \"I thought you said your dog didn't bite\" said the injured man. \n\"Thats not my dog\", replied the other.",
  "Q: What's the difference between a shoping trolley and a University vice chancellor? \nA: You fill them both up with as much food and alcohol you can, but it's only the shopping \ntrolley that has a mind of its own.",
  "Q. How do you catch a polar bear? \nA. You cut a hole in the ice and you put peas all round the edge and when the polar bear \ncomes along and stops for a pea, you kick it in the ice hole.",
  "Why do Marxists like fruit infusions? \nBecause all proper tea is theft!",
  "What was born to succeed? \nA budgie with a blunt beak.",
  "Three budgies in a cage, one on the top perch, one on the middle and one on the \nbottom perch. \nWhich Budgie owns the cage? \nThe one on the bottom perch, the other two are on higher perches.",
  "what do you call a fly with no wings? \na walk.",
  "What do you call a teacher with no arms, no legs, and no body? \nThe Head...",
  "Q: Why should you never iron a four leaf clover? \nA: You should never press your luck!",
  "What's ET short for? \nBecause he's got little legs.",
  "An 8-year-old girl went to her dad, who was working in the yard. \nShe asked him, \"Daddy, what is sex?\" \nThe father was surprised that she would ask such a question, but \ndecides that if she is old enough to ask the question, then she \nis old enough to get a straight answer. \nHe proceeded to tell her all about the 'birds and the bees'. When \nhe finished explaining, the little girl was looking at him with \nher mouth hanging open. The father asked her, \"Why did you ask \nthis question?\" \nThe little girl replied, \"Mom told me to tell you that dinner \nwould be ready in just a couple of secs.\"",
  "Did you hear about the ice-cream man, he was found dead in his ice-cream van, \ncovered in chocolate sauce and hundreds-and-thousands? The police said that he had \n?topped? himself.",
  "What lies on the bottom of the ocean and shakes? A nervous wreck.",
  "Two cannibals are sitting around eating a clown. One clown says to the other, \"Does \nthis taste funny to you?\"",
  "A piece of straight, clean string goes into a bar and orders a gin and tonic. The barman \nserves the drink, the string downs it and walks out. Ten minutes later a dirty, twisted, ragged \npiece of string walks into the bar. \"Here - are you that piece of string that was here ten \nminutes ago?\" asks the barman - \"No\" replies the string \"I'm a frayed knot\"",
  "there are these two sausages sizzling in a frying pan. the one turns to the other and \nsays \"gees, it's hot in here\" and the second one turns around and goes \"AAAAH!, a talking \nsausage\".",
  "Q - what did the grape say when the elephant trod on it? \nA - Nothing, it just gave a little wine.",
  "A man walks into a bar and is about to order a drink when he notices Van Gogh playing \nthe fruit machine. He calls over, \"Hey, Van Gogh! Want a drink?\" and Van Gogh replies, \"No \nthanks. I've got one 'ere.\"",
  "There were two cows in a field. One said \"moo\", the other one said \"I was going to say \nthat!\"",
  "What did the landlord say as he threw Shakespeare out of his pub? \n\"You're Bard!\"",
  "A three legged dog walks into a Saloon in the Wild West, the barman asks him what he \nwants. \nThe dog replies \"I'm looking fo the man that shot my paw\"",
  "Two owls are playing in the final of the Owl Pool Championship. It comes down to \nthe last frame. One of the owls is just about to play his shot, when his wing \naccidentally touches a ball. \n\"That's two hits,\" says the other owl. \n\"Two hits to who?\" says the first.",
  "An atom walks into a bar and asks the bartender if he's seen his missing electron. \n\"Are you sure she's missing\", asks the bartender. \n\"I'm positive\", replies the atom. \n(this is definitely a joke for science-minded people only)",
  "Patient : \"Doctor I keep hearing \"The green, green grass of home\" in my head. \nDoctor : \"That's called the Tom Jones Syndrome\" \nPatient : \"Is it common ?\" \nDoctor : \"It's not unusual",
  "Two aerials met on a roof, fell in love and got married. \nThe ceremony was rubbish but the reception was brilliant.",
  "Did you hear about the dyslexic agnostic insomniac ? \nHe used to lie awake at night wondering if there was a Dog !",
  "What do you call a donkey with 3 legs? \nA Wonky",
  "What?s brown and sticky? \nA stick",
  "A horse walks in to a bar. The bartender says: \"Why the long face?\"",
  "A Buddhist walks up to a hot dog vendor and says \"Make me one with everything.\"",
  "A mushroom walks into a bar. The bartender says to the mushroom. \"Hey we don't \nserve your kind here.\" The mushroom says \"why not I'm a fun guy\"",
  "What did the mayonnaise say to the refrigerator?",
  "PATIENT..Doctor , people keep ignoring me. \nDOCTOR...Next please.",
  "Q. What's the difference between a buffalo and a bison? \nA. You can't wash your hands in a buffalo.",
  "- How long did Cain hate his brother? \n- ? \n- As long as he was able...",
  "A grad student, a post-doc, and a professor are walking through a city park and they \nfind an antique oil lamp. They rub it and a Genie comes out in a puff of smoke. \nThe Genie says, \"I usually only grant three wishes, so I'll give each of you just one.\" \n\"Me first! Me first!\" says the grad student. \"I want to be in the Bahamas, driving a speedboat \nwith a gorgeous woman who sunbathes topless.\" Poof! He's gone. \n\"Me next! Me next!\" says the post-doc. \"I want to be in Hawaii, relaxing on the beach with a \nprofessional hula dancer on one side and a Mai Tai on the other.\" Poof! He's gone. \n\"You're next,\" the Genie says to the professor. \nThe professor says, \"I want those guys back in the lab after lunch.\"",
  "A penguin walks into a store and asks the teller, \"Do you have any grapes?\" \n\"No.\" He replies. This same thing happens the next day. On the third day the teller replies,\" \nNo, and if you come in asking for grapes again I will nail your flippers to the floor!\" On the \nnext the penguin walks in and asks,\" Got any nails? \"No.\" Replies the teller. \"Got any grapes!\" \nThe penguin asks!",
  "\"I got that job down the bowling alley\", \"What tenpin\", \"No it's permanent\"",
  "A man goes into the doctor with a penguin on his head. \nThe doctor says \"What can I do for you?\" and the penguin says \n\"well doc, it started as this growth on my foot...\"",
  "A man goes to the doctor and says \"Doctor, it hurts when I do this\", and raises his arm. \n\"Well, don't do it then\", says the doctor.",
  "Q: Did you hear about the Ice Cream Sales man that was found dead in his store \ncovered in chocolate sauce and syrup? \nA: Police think he topped himself!",
  "How many surrealists does it take to change a light bulb?",
  "- 1 to hold the giraffe and one to fill the bathtub with brightly coloured machine tools.",
  "Three vampires are sitting at a bar. Bartender asks the first one what he wants. \"I \nthink I'll have a glass of blood.\" \"Okay, what'll you have?\" he asks the second vampire. \"That \nsounds good. I'll have a glass of blood too.\" \"And what can I get for you?\" he asks the third \nvampire. \"I'll have a glass of plasma\" said the third vampire. \"Okay,\" said the bartender, \n\"That's two bloods and a blood light, then.\"",
  "A polar bear walks into a bar and the barman says, \"what would you like to drink?\". \nThe polar bear hangs his head and sighs deeply and then sayss \"I'll have a pint of bitter \nbarman\". \nThe barman looks at the bear and says \"why the big paws?\"",
  "What does an agnostic, dyslexic, insomniac do? \nStays up all night wondering if there is a Dog.",
  "A termite walks into a cocktail lounge, and asks a customer, \"Is the bartender here?\"",
  "A man goes to the vet about his dog's fleas. The vet says \"I'm sorry, I'll have to put this \ndog down\". The man is incredulous and asks why, and the vet says \n\"because he is far too heavy.\"",
  "An Englishman, an Irishman and a scotsman walk into a bar, the barman asks,\" Is this a \njoke?\"",
  "A guy goes to the Doctors and he says \"Doctor, I'm really worried about my brother, he \nthinks he's a Hen!\" \nThe Doctor says \"well have you taken him to see a psychiatrist?\", and the guy says \"Don't be \nstupid, we need the eggs!\"",
  "A group of Chess enthusiasts were kicked out of a hotel reception for discussing their \nwinning games. The manager can't stand chess nuts boasting in an open foyer.",
  "A brain and a pair of jumpleads walks into a bar. The brain orders two pints from the \nbarman but the barman refuses to serve him. When asked why, the barman replies \" Well \nyou're clearly out of your head, and your friend there looks as if he's about to start \nsomething\"",
  "The police arrested two men, one for drinking battery acid and the other for eating fire \ncrackers. They charged one and let the other one off.",
  "A man went to a horse breeder and said, I want that horse. The breeder said that horse \naint looking so good, but the man still wanted to buy it, so he did. The next day he came back \nwith the horse and said, you sold me a blind horse, the breeder replied I told you that horse \naint looking so good",
  "Two hikers were walking through the woods when they noticed a bear charging \ntowards them in the distance. The first hiker removed his trail boots and began to lace up his",
  "Before you criticize someone, walk a mile in their shoes. Then when you do criticize \nthem, you'll be a mile away and have their shoes.",
  "A man on a business trip is staying in a high-rise hotel with a bar on the top floor. \nAfter checking in and seeing his room, he decides to go upstairs. There's only one other \npatron in the bar. The businessman orders a drink and then watches in surprise as the other \npatron quickly eats an orange, chugs his beer, and jumps out the window. \nA minute later, the man returns. The businessman is shocked to see him again eat an orange, \nchug his beer and then jump out the window. \nWhen the man returns a third time, the businessman decides he can do this, too. He eats an \norange, chugs his beer, then jumps out the window to his death. \nThe bartender turns to the man and says, \"You know, Superman, you're a real jerk when \nyou're drunk.\"",
  "How many surrealists does it take to change a lightbulb? \nTwo, one to do it, and another to hold the fish.",
  "As a funeral train passes by a golf course, a golfer on one of the greens stops, \nstands at attention with hat held over his heart as the hearse goes by. Then he \ngoes back to lining up his putt. His playing partner remarks how that was the \nnicest gesture he'd ever seen, to show such respect for the dead. The first \ngolfer sinks his putt and says, \"Well, she was a good wife for sixteen years.\"",
  "A woman has twin boys and gives them up for adoption. One goes to a family in Egypt, \nand is named \"Amahl.\" The other goes to a family in Spain and is named \"Juan.\" Years later, \nJuan sends a picture of himself to his birth mom. Upon receiving the picture, she tells her \nhusband that she wishes she also had a picture of Amahl. Her husband responds, \"But they \nare identical twins. If you've seen Juan, you've seen Amahl.",
  "What do you call a boomerang that doesn't come back? \nA stick.",
  "Man walking down the street meets a friend who has a lobster tucked under his arm. \n\"Are you taking that lobster home to dinner?\" he asks. \"No,\" says friend, \"he's had his dinner \nand now I'm taking him to the pictures\".",
  "A man is sat at home watching T.V. when he hears a knock at the door. The man gets \nup and answers the door, to his astonishment there is a snail at the door. The snail says \"can i \nsell you some double glazing.\" To which the man replies \"no\" and kicks him down the street. \nTwo weeks later there is another knock at the door. The man answers it and it is the snail \nagain. The snail then say \"what did you do that for then.\"",
  "Patient: \"Doctor, Doctor I think I'm a pair of curtains.\" \nDoctor: \"Pull yourself together man.\"",
  "Patient: Dr, Dr - I can't get this song out of my head and it's driving me mad. I can't \nstop humming \"It's Good to Touch the Green Green Grass of Home\" \nDoctor: \"Hmm, sounds like Tom Jones Syndrome\" \nPatient \" Never heard of it\" \nDoctor \"Well it's not unusual ...\"",
  "Extra strong mint and Mars bar are having a drink in the pub. Extra strong mint says \nto Mars Bar, `I'm the hardest mint in town me! No-one's harder than me!'. With that, the bar \ndoors swing open and in walks a Halls mint. Mars bar turns around and extra strong mint is \nquivering under the table. Mars bar says, `Hang on a minute, I thought you were the hardest \nmint in town?!'. Extra strong mint says, `I might be hard, but he's menthal!'",
  "Q. Why do cows have bells \nA. Because there horns dont work",
  "Three American Indian women in the wild west are about to give birth. One is lying on \na buffalo skin; one is lying on a moose skin; and one is lying on a hippopotamus skin. The first \nwoman gives birth to a boy. The second gives birth to a girl. And the third gives birth to a boy \nand a girl. And this proves . . . the squaw of the hide of the hippopotamus is equal to the sum \nof the squaws of the other two hides!",
  "Guy walks into the doctor's with a strawberry growing out of his head. \nDoctor says 'I can give you some cream for that'.",
  "A man goes to a diner. On the menu it says, \"Breakfast Served Anytime\" so, when the \nwaitress comes he orders French Toast during the Renaissance!",
  "Q: What happens to Composers when they die. \nA: They decompose",
  "2 atoms were talking, 1 atom said to the other \"why are you crying?\" the atom replied \n\"I've lost an electron\", the first atom said \"are you sure?\", \"yes\" replied the other \"I'm \npositive!\"",
  "Two men jump out of a plane. One is holding a Budgerigar, the other is holding a \nParrot and a shot-gun. As they fall away from the plane the man holding the budgie lets it go. \nA moment later the man with the Parrot lets go of his bird and takes a lame shot at it with the \nshotgun. \nThey both hit the floor. \nIn their dying moments, one turns to the other and says, \"I don't think much of this \nBudgiejumping\" \nThe other dying man turns to him and replies, \"No, i don't think much of this high altitude \nparatchuting!.\"",
  "I drunk driver is stop for heading the wrong way on a one-way street. \nThe police officer asked the driver didn't you see the arrows. \nThe drink responds, \"Arrows, I couldn't even see the Indians.",
  "A man took his dog to the vet. \"Sorry,\" said the vet, \"but your dog is dead\". Distraught \nman asks the vet for a second opinion-- the vet brings in the practice cat. Cat sniffs around--\nno response from dog. Vet says \"sorry, but your dog is dead\". Man insists on a third opinion, \nso vet brings in the practice labrador. Practice dog sniffs around--no response from man's \ndog. Reluctantly the man accepts his dog is dead. On the way out, the receptionist gives him a \nbill for 1000. \"Good grief,what is this for? \"Well, said the receptionist, \"it's 50 for the vet, \n300 for the catscan and 600 for the lab report.",
  "what game do you play with a wombat? \nanswer - wom",
  "a man walks into a shop and says \"i'd like to buy a wasp, please.\" \nthe shopkeeper replies \"i'm sorry, sir, we don't sell wasps.\" \n\"but,\" says the man \"you have one in the window.\"",
  "A white horse walked into a pub and ordered a lager. The landlord put the drink on \nthe bar and said 'We've got a whisky named after you'. The horse replied 'what, Eric?'.",
  "While robbing a home, a burglar hears someone say, \"Jesus is watching you.\" To his \nrelief, he realizes it is just a parrot mimicking something it had heard. \nThe burglar asks the parrot, \"What's your name?\" \nThe parrot says, \"Moses.\" \nThe burglar goes on to ask, \"What kind of a person names their parrot Moses?\" \nThe parrot replies, \"The same kind of person that names his Rottweiler Jesus.\"",
  "How many psychiatrists does it take to change a light bulb? \nOnly one, but the light bulb's got to want to change.",
  "Where can you find a Mozambique. \nOn a mozam-bird!",
  "Q: What's brown and sticky? \nA: A stick.",
  "A man gets knocked down by a truck. A guy says to him are you comfortable. \nHe says I make a living!",
  "Why does a chicken coop have 2 doors? \nBecause if had 4 doors it would be a chicken sedan.",
  "Q. Where do you keep a baby ape?",
  "What do you call a cow in a paddock with only two right legs... \nLean Beef",
  "Kid \"Mummy! Mummy! There is a man with a bill at the door\" \nMother \"Dont be silly dear, it must be a duck with a hat on!\"",
  "Q: What do you call a fly with no wings? \nA: A walk",
  "A shipwreck survivor washes up on the beach of an island and is immediately \nsurrounded by a group of native warriors. \"I'm done for\", the man cries in despair. \n\"No you are not,\" comes a booming voice from the heavens. \"Listen carefully, and do exactly \nas I say. Grab the spear from the one who is beside you and shove it through the heart of the \nchief.\" \nThe man does so, and the remainder of the band stare in disbelief. \"Now, what?\" the man \nasks the heavens. \n\"Now, you are done for.\"",
  "Two caterpillars were crawling along a leaf when a butterfly flew past \noverhead. One caterpillar turned to the other one and said: \"You'll never \nget me up in one of those things !\"",
  "A man walks into a chip and asks for fish and chips twice please. \nThe man behind the counter says \"I heard you the first time\"",
  "I was in the waiting room of my doctor's office the other \nday when the doctor started yelling, \"Typhoid! Tetanus! Measles!\" \nI went up to the nurse and asked her what the hell was going on. \nShe told me that the doctor liked to call the shots.",
  "Why is a tractor magic? \nBecause it can go down a road and turn into a field!",
  "?Sally, can you spell ?water? for me?? The teacher asked. \nH I J K L M N 0 answered Sally promptly \nHer teacher look puzzled. ?That doesn?t spell ?water.?? ?Sure it does,? said Sally. ?It?s all the \nletters from H to O.?",
  "A man walks into a bar and notices two pieces of beef nailed to the ceiling. He asks the \nbarman why they're there. \"It's a competition. If you can climb up there and get those bits of \nmeat down you'll get free drinks all night. But if you try and fail then you'll have to buy a \nround for everyone in the pub. Do you fancy having a go?\" The man has a long, hard look at \nthe ceiling before saying, \"No, I'll just have a pint thanks. The steaks are too high.\"",
  "Close your eyes. Dark isn't it?",
  "Why did Ludwig v. Beethoven kill his two ducks? - They wouldn't stop saying \"Bach \nbach\" all the time..",
  "What is green and if it were to fall from a tree would kill you? A snooker table",
  "why don't polar bears eat penguines? \nbecause they can't get the wrappers off...",
  "A skeleton walks into a pub and says, \"Pint of bitter and a mop.\"",
  "Doctor, Doctor, I can?t pronounce my F?s, T?s and H?s.? \n?Well you can?t say fairer than that then?",
  "What did the bird say as it flew over ASDA? \"Cheap Cheap\"",
  "For a laugh three french soldiers put mustard in their ears from then on they are called \nthe three mustardears!!!",
  "A blonde girl's husband buys her a mobile phone. She takes it out and he decides to \ntest it out. He phones her and she answers it. \n\"It's very good,\" she says, \"but how did you know I was at the hairdressers?\"",
  "A man walks into a bar and orders a pint. Then he hears little voices saying things like \n'Oooh, you look really nice' and 'That haircut really suits you'. He tells the barman about it \nwho says 'Just ignore it, it's the peanuts, they're complimentary'.",
  "AN ardvark walks into a bar and the bartender says why the long face.",
  "a worried man goes to see his priest. \n\"Father, I am worried. I think that my wife is trying to poison me.\" \nSaid the priest: \"Hold on my son, let me talk to your wife and come back to see me tomorrow, \nthen I shall be able to give you some advice.\" \nThe following day the man aging comed to his priest who tells him: \"Well my son, I have \ntalked to your wife for nearly two hours. My advise to you is :Take the poison\"",
  "Q. Why did the koala fall out of the tree? A. Because it was dead \nQ. Why did the second koala fall out of the tree? A. Because it was holding on to the first koala. \nQ. Why did the third koala fall out of the tree? A. Because he thought it was a game. \nQ. Why did the little boy fall off his bike? A. Because he was hit by three koalas.",
  "A horse walks into a bar, the bartender turns & asks the horse whats with the long \nface.",
  "An Englishman, an Australian and an American walk into a bar. The barman asks them \n\"is this a joke?\"",
  "A man put on a clean pair of socks every day of the week. By Friday he could hardly \nget his shoes on.",
  "How many psychiatrists does it take to change a light bulb? \nJust one -- but the light bulb really has to want to change.",
  "What do you get when you pour boiling water down a rabbit hole? \nHot cross bunnies.",
  "Did you hear about the termite who walked into an all-wooden bar and asked, \"Is the \nbartender here?\"",
  "The doctor says to the patient, \"You're in excellent health - you'll live to be 90.\" The \npatient replies, \"But Doctor, I am 90!\" The doctore responds, \"Well, that's it, then.\"",
  "there are 3 wives who want to decide what to wear. first one says ,my husband has \nblack hair I will wera black dree. second says my husband hair is grey and I will wear a grey \ndress and the third one gets worried and starts panicking. when asked she tells the other two \nthat her husband is bald so she would have to wear nothing to the party.",
  "What will Postman Pat be called when he retires? \nPat",
  "Why did the monkey fall out of the tree? \nanswer: he was dead",
  "A pork Pie walks into a Pub and says 'Ill have a pint please',to which the landlord \nreplies - 'sorry we dont serve food'.",
  "A man took his Rottweiler to the vet and said to him, \"My dogs cross-eyed. Is there \nanything you can do for it?\" \n\"Well\", said the vet, \"Let's have a look at him.\" So he picks the dog up by the ears and has a \ngood look at its eyes. \n\"Well,\" Says the vet, \"I'm going to have to put him down.\" \n\"Just because he's cross-eyed?\" said the man. \n\"No, because he's heavy,\" said the vet.",
  "George Howard, the man famous for writing the Hokey Polky died last week. They had \na horrible time at the funeral parlor, first they put his left leg in....",
  "A man died and his wife phoned the newspaper to place an obituary. She called the \nobituary department and said, \"This is what I want to print: Bernie is dead.\" The man at the",
  "Sadie's husband Jake has been slipping in and out of a coma for several months, yet his \nfaithful wife stays by his bedside day and night. One night, Jake comes to and motions for her \nto come closer. He says, \"My Sadie, you have been with me through all the bad times. When I \ngot fired, you were there to support me. When my business failed, you were there. When I got \nshot, you were by my side. When we lost the house, you gave me support. When my health \nstarted failing, you were still by my side. You know what, Sadie?\" \"What dear?\" she asked \ngently. \"I think you're bad luck.\"",
  "A little boy went up to his father and asked: \"Dad, where did all of my intelligence \ncome from?\" The father replied: \"Well, son, you must have gotten it from your mother, 'cause \nI still have mine.\"",
  "Why is the number eight afraid of the number seven? \nBecause seven ate nine.",
  "A neutron walks into a bar, and says \"Give me a beer.\" \nThe bartender says \"Hey! Neutron! For you - no charge!\"",
  "One morning, a girl says to her mum, \"Does God use our bathroom?\" \nHer mum replies, \"No dear, why do you ask?\" \nThe little girl says, \"Well, every morning daddy says 'Oh God, are you still in there!\"",
  "A man driving into town spots a truck broken down on the side of the road. He stops to \nhelp. The truck driver says he is on his way to deliver some penguins to the zoo. The truck \ndriver say, \"I'll give you some cash if you could take the penguins to the zoo for me.\" The man \nagrees. \nLater, when the truck is fixed,the truck driver drives into townand spots the man close to the \nzoo, walking with a row of pengiuns waddling behind him, away from the zoo. \nThe truck driver stops and asks, \"What are you doing? I gave you money to take the penguins \nto the zoo?\" \nThe man replies., \"I did , but we got change so we're going to the movies!\"",
  "Where do sheep get their haircut? \nAt the Bah-Bah-Shop.",
  "What do you get if you cross frosty the snowman with count dracula? Frostbite",
  "Did you hear about the two maggots who were fighting in dead Earnest?",
  "What do you call a woodpecker without a beak? \nA Head banger",
  "were do computers go on hoilday ? the big apple",
  "Q: How do you catch a unique rabbit? \nA: Unique up on it. \nQ: How do you catch a tame rabbit? \nA: The tame way.",
  "why did the chicken cross the road? \nTo get to the other side...",
  "Two sailors are eating biscuits together. One breaks a biscuit and two bugs, one large \nand one small, jump out and run across the table. The sailor asks his mate, \"Now, is it better \nto eat the big one or the small one?\" The other replied, \"The answer is simple: you must \nalways choose the lesser of two weevils.\"",
  "Did you hear about the dyslexic, agnostic insomniac? He lies awake all night long, \nwondering if there really is a dog.",
  "What did the Buddhist say to the hot dog vendor? \"Make me one with everything.\"",
  "what did the 0 say to the 8? \nNice belt!",
  "Where would you find a tortoise with no legs ? Wherever you left it",
  "Why did the squirrel fall out of the tree? \nIt was dead. \nWhy did the second squirrel fall out of the tree? \nIt thought it was a game. \nWhy did the tree fall over? \nIt thought it was a squirrel!",
  "A sandwich walks into a bar and orders a beer and the barman says \"I'm sorry we \ndon't serve food\"",
  "What's brown and sits on a piano bench? \nAnswer: Beethoven's Last Movement",
  "Bob is sitting in a bar next to a guy named Clark. Clark gets his usual and drains it he \nthen turns to Bob and says, \"I bet you I can jump of the roof and loat to the ground.\" Bob says \n\"okay go for it.\" So clark jumps and floats to the ground. So Bob orders what clark just had \nand tries to jump and float. So he jumps and SPLAT he hits the ground and dies. Clark walks \nback in the bar and the barkeep says \"You know Superman you're really mean when your \ndrunk!\" \nRimshot!!",
  "Did you hear that they dug up Beethoven's body last week? They found him \ndecomposing.",
  "what do an eagle and a lion have in common? \nthey both have wings, except for the lion.",
  "how do you get a pikachu onto a bus? you pokemon",
  "Why did the worker get fired from the orange juice factory? Because he couldn't \nconcentrate",
  "What do you call a donkey with three legs? \nA wonkey.",
  "What do you call a man in a bush? \nRussell.",
  "A man walks into a bar and says- \"ouch thats hot\", It was a BARbeque.",
  "Theres a toilet on a hill. There is a man walking up the hill and a man walking down \nand a man in the toilet. What are there nationalitys? \nthe man going up is Russin and the man going down is finishan and the man in the toilet is \neuropean.",
  "Q. Why did the chicken cross the playground? \nA. To get to the other slide.",
  "what do mexicans keep under the carpet? Underlay! Underlay! Underlay!",
  "Newspaper Headline: Man who commits suicide twice is sentenced to life in prison.",
  "Q: What is red and looks like a bucket? \nA: A Red bucket! \nQ: What is blue and looks like a bucket \nA: A Red bucket in disguise!",
  "Q: What is gray? \nA: A melted penguin!",
  "Q. What's the difference between a buffalo and a bison? \nA. You can't wash your hands in a buffalo.",
  "Why did the monkey fall out of the tree? \nIt was dead. \nWhy did the squirrel fall out of the tree? \nIt was stapled to the monkey.",
  "A man driving on a highway is pulled over by a police officer. The officer \nasks, \"Did you know your wife and children fell out of your car a kilometre \nback?\". \nA smile creeps onto the man's face and he exclaims, \"Thank God! I thought I \nwas going deaf!\"",
  "Q: where is a cemetery located in any town? \nA: In the Dead center of it!",
  "A couple of New Jersey hunters are out in the woods when one of them falls to the \nground. He doesn't seem to be breathing, his eyes are rolled back in his head. \nThe other guy whips out his cell phone and calls 911. He gasps to the operator, \"My friend is \ndead! What can I do?\" \nThe operator, in a calm soothing voice says, \"Just take it easy. I can help. First, let's make sure \nhe's dead.\" \nThere is a silence, then a shot is heard. The guy's voice comes back on the line. He says, \"OK, \nnow what?\"",
  "A man walks into a bar and says ouch!!! \nGet it?",
  "baby polar bear asks its dad, 'am i a black bear?' 'no' says dad. 'am i a grizzly bear?' \n'no, you're a polar bear. go ask your mother, son.' baby polar bear asks its mum, 'am i a \nbrown bear, or a sun bear?' 'no', says mum. 'am i a black bear or a koala bear?' 'no, you're a \npolar bear. why do you ask, son?' 'because i am so cold...!'",
  "A newly ordained priest is nervous about hearing confessions and asks an older priest \nto observe one of his sessions to give him some tips. After a few minutes of listening, the old \npriest suggests that they have a word. \"Iv'e got a few suggestions,\"he says. \"Try folding your \narms over your chest and rub your chin with one hand.\"The new priest tries this. \"Very good,\" \nsays his senior. \"now try saing things like 'I see','I understand' and 'Yes, go on.'\" \nThe ounger priest practises these sayings, too. \n\"Well done,\" says the older priest. \"Don't you think that's better than slapping your knee and \nsaying, 'No way!what happened next?'\"",
  "Claire: Knock Knock \nNeil: Who's there? \nClaire: An interrupting cow \nNeil: An interrupt.. \nClaire: MOO",
  "Man goes to the doctor and complains that every time he touches his foot he feels \nexcruciating pain. The doctor writes it down and asks if it gurts anywhere else. To \ndemonstrate, the man also touches his shin and thigh and screams out with pain. Although \nthe doctor examines tha man, he can not diagnose the source of the pain and refers him to a",
  "What do you call an aarvark that has been beaten up? \nA vark.",
  "What is the difference between a doctor and God? God doesn't think he is a doctor!",
  "Why did the whale jump out of the water? To get to the other side.",
  "Q. What did the English policeman say when he came home and found his wife in bed \nwith three men? A. 'Ello. 'Ello. 'Ello!",
  "Man is looking down from a plane as it flies over the Pacific Ocean. He turns to the lady \nnext to him and asks: That island down there. Is it pronounced Hawaii or Havaii? The woman \nreplies Havaii. The man says: Thank you. The woman replies: You're velcome!",
  "Why did the 'possum cross the road? To get half-way across. \nWhy did the chicken cross the road? To show the 'possum it could be done. \nWhy did the anarchist monkey cross the road? He was stapled to the chicken. \nWhy didn't the skeleton cross the road? No guts.",
  "A man walks into a restaurant and growls at the maitre d', \"Do you serve crabs here?\" \nthe maitre d' responds \"We serve anyone. Have a seat sir.\"",
  "In a 3rd grade class Jonny was asked if he knew what a canabil was. He said to the \nteacher \"no sir\" \"Well, if you ate your parents what would you be?\" Jonny,s teacher asked him \nand Jonny said \"An orphen, sir\"",
  "Did you hear about the rooster who stayed awake all night so that he could see where \nthe sun went? \nIt finally dawned on him.",
  "Two guys walk into a bar. The third guy ducks.",
  "What is the new pirate movie rated? Arrrrrrrrrrr.",
  "The monks were busy in the monastery copying those beaytiful illuminated \nmanuscripts that they used to do when one young monk suggested that since they were \ncopying copies perhaps it might be timely to examine the original to make sure that their \ncopies were correct. The Abbot agreed and sent the monk down into the basement of the \nmonastery to find and examine the original. The young monk was away for some time and \nfinally the abbot went to find him. When he did he found himmin tears and asked him what \nwas wrong. Through his tears the monk blurted out \"The word was celebrate!\"",
  "Learn the rules so you know how to break them properly.",
  "If you never can make things work from the first try, skydiving is not for you.",
  "I was getting forgetful so I went to the neighbors and aske the husband what is the \nname of your mental doctor that you have been braging about.He aske me what flower has a \nlong steam with thorns.I said a rose.He said thank you,thank you,hey Rose what is the name \nof my memory doctor.",
  "Never wrestle with a pig: You both get all dirty, and the pig likes it.",
  "I have seen the truth and it makes no sense.",
  "A man ran into the house breathless and he said to his wife, \"Honey, you should be so \nproud of me, I just saved $1.50 by not taking the bus, but I chased it all the way home- The \nwife replied, \"You want a medal for that?-You should have chased a cab and saved yourself \n15!",
  "A duck walks into a pharmacy. He says, \"I'd like a chapstick.\" The pharmacist hands \nhim the chapstick and asks, \"will that be cash or charge?\" The duck replies, \"just put it on my \nbill.\"",
  "There are two fish in a tank. \nThe first fish says to the second fish: \"How the hell do we drive this thing?\"",
  "Helicopters can't really fly - they're just so ugly that the earth \nimmediately repels them.",
  "whats brown and sticky? \na stick",
  "Why did the monkey fall out of the tree? It was dead.",
  "Did you hear about the maniac riding on the subways chopping peoples arms off? \nThe police caught him and charged him with armed robbery!",
  "A biology student had to write a computer program, but he had troubles \nto make it work. He asked his roommate, who was a computer science major, \nto look at his programm and tell him where the error is. The computer \nguy looked through the code for some time, then glanced desperately at his \nfriend and said: \"In DNA\".",
  "What do you call a cow with no legs? Ground beef.",
  "How can you tell the difference between a dead cat in the road or \na dead lawyer in the road? The dead cat has tread marks.",
  "Well, you see, there are basically three kinds of people in the world. Those who can \ncount and those that can't.",
  "- Can you swim? \n- Some times. \n- What do you mean by \"some times\"? \n- Only when I'm in the water.",
  "A man walks into a psychiatrist's office dressed only in saran wrap. The psychologist \ntakes one look at him and says, \"I can clearly see you're nuts.\"",
  "Why did the monkey fall out of the tree? \nHe was dead. \nWhy did the second monkey fall out of the tree? \nHe was stapled to the first monkey. \nWhy did the third monkey fall out of the tree? \nPeer pressure.",
  "First magician: \"Who was that lady I sawed with you last night?\" \nSecond magician: \"That was no lady; that was my half-sister!\"",
  "Why does a golfer bring two pairs of pants when he plays golf? A Incase he gets a hole \nin one.",
  "whats a good parting gift? A comb",
  "Knock knock \nWho's there? \nDishwasher \nDishwasher who? \nDish wash er way i spoke until i got my false teeth",
  "How do you make a hankichief dance? Put a little bogey in it.",
  "How do you hide an elephant in a cherry tree? You paint its toenails red!",
  "What is read white and black all over? A used newspaper!",
  "Did you hear about the two atennae that got married? The wedding wasn't very good, \nbut the reception was teriffic!",
  "a guy takes his nasty dog for a walk every night and manages to beat up another dog \nevery night. one night while walking his dog he comes upon this guy walking a yellow dog, he \nunleases his nasty dog saying \"go get him boy\", as he runs up to the yellow dog, the yellow \ndog grabs him by the neck, shakes him a couple of times, flips him over and breakes his neck",
  "The man had gone to the dentist for his annual checkup. The dentist asked the man if \nhe had been eating anything over the past few months that was not ordinarily in his diet. The \nman said, \"Why yes, I have as a matter of fact. My wife developed a new receipt for hollandise \nsauce that is just terrific and I have been putting it on almost everything that I eat.\" \"Well\", \nsaid the dentist, \"I'm afraid that the acid in the lemon juice used in the hollandise sauce has \nstarted to corrode your dental plate. I'll have to make you a new plate. But this time, I'll make \nit out of chrome.\" \"Out of chrome!\" exclaimed the man. \"Why would you do that?\". \n\"Because,\" said the dentist........\"as everyone knows\"......\"there's no plate like chrome for the \nhollandise\"",
  "Why dont English rugby players get vaccinated before touring? \nthey never catch anything.",
  "Q:Why can't two elephants go swimming at the same time? \nA:Because they only have one pair of trunks!",
  "Q:-How many surrealists does it take to change a lightbulb? \nA:-Fish.",
  "A length of Rope went into a bar, sat on a stool, and ordered a beer. The Bartender \nsaid, \"We don't serve Ropes here.\" Dismayed and disappointed, the Rope went out and then \ngot an idea. He stopped a man and asked, \"Will you please tie a knot in me and separate my \nstrands at both ends?\". The man obliged, and with this done, the Rope went back into the bar \nand again ordered a beer. The Bartender looked him over and said, \"Say, aren't you the same \nrope who was in here before?!\" \"No,\" was the reply, \"I'm a frayed knot.\"",
  "Q. Why did the ram jump over the cliff? \nA. He didn't see the ewe turn.",
  "Why do bees hum ? Because they don't know the words",
  "Two not so bright people walking along one day. One says 'Horse tracks!', the other \ndisagrees, 'Rabbit tracks I think' just before the train hit them!",
  "Whats ET short for? Because he's got little legs!",
  "a bear walks into a bar and says \"Can I have a pint of lager and................................................a \npacket of crisps please?\" \nthe barman says \"Why the big pause\"",
  "Did you read about the midget clarivoyant who escaped from jail? The headline said \n\"small medium at large.\"",
  "How many psychiatrists does it take to change a lightbulb? Only one, but the \nlightbulb's gonna want to change.",
  "A penguin walks ito a bar and asks the barman \"have you seen my brother?\" \nthe barman replies \"I dunno, What does he look like?\"",
  "There was a husband and his wife sitting next to a drunk in a \nbar. Suddenly the drunk stands up and yells, \"ATTENTION \nALL\" and farts loudly. \nThe wife is extremely embarrassed, and the husband looks at \nthe drunk and says\" Excuse me, you just farted before my \nwife.\" \nThe drunks replies,\" I'm sorry I didn't know it was her turn.\"",
  "Why did the tomato turn red? \nShe/He saw the salad dressing!",
  "What do you call a deer with no eyes? \nNo idear.",
  "A guy walks in to his psychiatrists office and says\" Doc you got to help me, One night I \ndream I'm a tepee and the next night i dream that i am a wigwam.\" The doctor say's,\" relax, \nyou're two tents.\"",
  "What do you call a deer with no eyes and no legs? \nStill no idear.",
  "\"Doc, I can't stop singing the green green grass of home\" \n\"that sounds like Tom Jones syndrome\" \n\"Is it common?\" \n\"It's not unusual..\"",
  "From The Times: \n'A young girl, who was blown out to sea on a \nset of inflatable teeth, was rescued by a \nman on an inflatable lobster. A coast-guard \nspokesman commented: \n\"This sort of thing is all too common these days.\"'",
  "what has 2 legs and bleeds profusely? \nHalf a cat",
  "A man wakes up in hospital.",
  "One penguin says to another, \"You look like you're wearing a tux.\" \nThe second penguin replies, \"Who says I'm not?\"",
  "Why do elephants put catsup in their navels? \nAnswer: So they can eat french fries while lying on their backs.",
  "This chap lives alone and he was feeling a bit lonely, so he goes to \nthe pet shop to get something to keep him company. The pet shop owner \nsuggested an unusual pet, a talking millipede. \n\"OK,\" thought the man,\"I'll give it a go...\" \nSo he bought a millipede, took it home, and for lack of advance preparations, made it a \ntemporary home in a cardboard box. \nThat evening testing his new pet, he leaned over the closed box and \nsaid, \"I'm going to the pub for a drink, do you want to come too?\" \nHe waited a few moments but there was no reply. \nHe tried again, \"Hey, millipede, wanna come to the boozer with me???\" \nAgain, no response. \nDisgusted by his gullible nature, he decided to give it one more try \nbefore returning the millipede to the pet shop. \nSo he got real close to the box and repeated rather loudly , \"I SAID I'M GOING TO THE PUB \nFOR A DRINK. DO YOU WANNA COME?\" \n\"I heard you the first time!!\" snapped the millipede, \"I'm just putting my bloody shoes on...\"",
  "Did you hear about the farmer who won the Nobel Prize for being outstanding in his \nfield?",
  "Two drunks are sitting at a bar. \nThe first one says, \"What's this thing that they call a 'Breathalyzer'?\" \nThe second guy says, \"It's a bag that can tell how much you drank.\" \nThe first guy says, \"I married one of those things years ago.\"",
  "There were three guys. They each were asked to name something green, pink and \nyellow. The first guy said \"my shirt is green, my tie is pink and my pants are yellow\". The \nsecond guy said \"the grass is green, the sun is yellow and my door is pink.\" The third guy said \n\"the phone goes 'green green', I pink it up and say 'yellow'\".",
  "A white horse goes into a pub and orders a drink. \nThe publican says, \"Here, we've got a drink named after you!\" \nThe horse says, \"What, Eric?\"",
  "What do you call a woman with one leg shorter than the other? \nAnswer: Ilene \nWhat do you call her if she's Japanese?",
  "What's orange and sounds like a parrot? \nA carrot!",
  "A truckdriver saw a priest hitchhiking. He thought he would do a good turn and pulled \nthe truck over.\"No problem, Father! Ill give you a lift. Climb in the truck.\" The happy priest \nclimbed into the passenger seat and the truck driver continued down the road. \nSuddenly the truck driver saw a lawyer walking down the road and instinctively he swerved \nto hit him. But he remembered there was a priest in the truck with him, so at the last minute \nhe swerved back away, narrowly missing the lawyer. But even though he was sure he missed \nthe lawyer he still heard a loud \"THUMP\". He glanced in his mirrors and when he didnt see \nanything, he turned to the priest and said, \"Im sorry Father. I almost hit that lawyer.\" \n\"Thats okay,\" replied the priest. \"I got him with the door!\"",
  "Craig David ,Shaggy and Britney Spears wre stuck in an elevator when they smelled \nsomething like rotten eggs,Craig David said \"I'm walkin' away\",Shaggy said \"it wasn't me\" and \nBritney Spears said \"Oops I did it again\"",
  "What do you get when you cross an elephant and a kangaroo? \nBig holes all over Australia!!",
  "Q. Who won the boxing match between the beaver and the hedgehog? \nA. The hedgehog, on points.",
  "A man was walking in the park when he came across a koala .He took it to the \npolieman and sid \"i've found this koala what should i do with him\" The policeman said ,\"take \nhim to the zoo\" \nThe next day the policeman was walking in the same park when he saw the same man with \nthe same koala. He said , \"didn't i tell you to take that koala to the zoo?\" \n\"Yes\", The man answered, that's what I did and today I'm taking him to the movies.",
  "A man finds a genie who says that it will grant him three wishes but that every \npollitition in Australia would get double. \nThe man says, \"Ok, I wish for $1 million\" \n\"Granted\", says the genie, \"but remember every pollitition in Australia will get double\" \nThe man says, \"Ok, now I wish for a Ferrarii\" \n\"Granted\", says the genie, \"but remember every pollitition in Australia will get double. Your \nfinal wish?\" \nThe man says, \"I wish to have one of my kidneys removed\"",
  "what's white blue and green? A fridge wearing jeans sitting in a field!!!",
  "Whats brown and sounds like a bell? \nDung!",
  "What is grey and goes bang, bang, bang, bang? \nA four-door elephant",
  "A duck walks into a drugstore, and asks the cashier if he has any beer. The man says \n\"No, this is a Drugstore, we don't sell beer here\" The Duck leaves, and returns home. The next \nday, he comes back to the store and asks the cashier again. The man then replies, \"I told you \nyesterday! We dont' sell beer here! If you ask me one more time, I am going to nail your feet \nto the florr!\" The ducks leaves again. One final time the duck enters the store the next day, \nand this time says, \"Do you have any nails?\" The Man replies, \"No\" The duck then says, \"Do \nyou have any beer?\"",
  "what do you call am italian with a rubber toe? Roberto",
  "Why do elephants have big ears? \nNoddy wouldn't pay the ransom",
  "How do you stop a bear from charging? You take away its credit card.",
  "A man took his Rottweiler to the vet. \n\"My dog's cross-eyed, is there anything you can do for him?\" \n\"Well,\" said the vet, \"let's have a look at him.\" \nSo he picked the dog up and examined his eyes, then checked his teeth. \nFinally, he said, \"I'm going to have to put him down.\" \n\"What? Why? Because he's cross-eyed?\" \n\"No, he's heavy.\"",
  "Why didn't the skeleton cross the road? \nHe didn't have the guts to do it!",
  "What time is it? \nTime you got a new watch.",
  "Two elephants fall off a cliff. \nThud. Thud.",
  "Why did the man drown in a bowl of cake mix? \nHe got pulled under by a particularly strong current!!",
  "why do ducks have flat feet? \nTo stamp out forest fires!!",
  "What do you call a fly with no wings? \nA walk!!!",
  "What do you call a child who fries and eats both his parents? \nAn orphan.",
  "Newspaper Reports say a toilet has been stolen. \nPolicve say they have nothing to go on",
  "Why has Edward Woodward got so many 'D's in his name? \nBecause otherwise he'd be called Ewar Woowar",
  "Did you hear about the scarecrow that won a Nobel prize? He was out, standing in his \nfield.",
  "Why did the golfer wear two pairs of trousers? \nIn case he got a 'hole in one'!",
  "How do you get four elephants into a Mini? \nTwo in the front, two in the back.",
  "What do you call a mushroom at a disco? \nA fun guy",
  "Two atoms are walking down the road. \nOne says to the other, \"OH NO! I just dropped an electron!\" \n\"Are you sure?\" asks his friend. \n\"Yes\" he replies \"I'm POSITIVE!\"",
  "A bunch of highland cows are standing in a field in Scotland. \nWhich one's on holiday? \n...The one with the wee calf!",
  "- Knock knock. \n- Who's there? \n- Buh \n- Buh who? \n- Don't be sad",
  "Two pieces of tarmac go into a pub and boast to the barman about how hard they are, \n\"We're motorway us.\" \nThen another piece of tarmac enters and the first two hide under a table. \"What's wrong?\" \nsays the barman, \"I thought you were really hard?\" \n\"We are,\" they say, \"but he's a cycle path.\"",
  "A long time ago, there were 3 little bears.....now there's lots of them",
  "What is black and white and eats like a horse? \nA Zebra",
  "There were two cows in a field. One said \"moo\", the other one said \"I was going to say \nthat!\"",
  "What's Brown, sits in a tree and can't sing? \nDes O'conker",
  "How do you kill a circus? Go for the juggler.",
  "How do you turn a duck into a soul singer? \nStick it in the oven and wait till its Bill Withers.",
  "why did the swedish factory worker get sacked?? \nBecause he always took stock home! (stockholm!)",
  "There was a teddy bear who went to work on a building site. On his first day he went \noff for lunch and left his tools behind. When he came back he noticed that his pick was \nmissing. When he told the foreman the foreman said \"Didn't you know today's the day the \nteddy bears get their picks nicked\"!",
  "A man goes to the doctor and says 'Doctor, there's a piece of lettuce sticking out of my \nbottom'. The doctor asks him to drop his trousers and examines him. The man asks 'Is it \nserious, doctor?' and the doctor replies 'I'm sorry to tell you but this is just the tip of the \niceberg'.",
  "what do u call thieves on a washing line? \nans: knickers",
  "Did you hear about the man who drowned in a bowl of muesli? \nHe was pulled under by a strong currant!",
  "A young girl is walking along the river and comes across a religious gathering where \nthe minister is baptizing members of his flock. The minister asks the girl if she has found \nJesus. No, she says. Whereupon the minister pushes her underwater, pulls her back up, \nand repeats, Have you found Jesus? No, she says, and is dunked back in the water and \nagain asked, Have you found Jesus? No!, she says in exasperation, Are you sure this is \nwhere he fell in?",
  "Shakespeare walks into a pub. The bloke behind the counter says, \"I'm not serving you \nmate - you're Bard.\"",
  "Two parrots sitting on a perch.One says to the other, \"Can you smell fish?\"",
  "Why is 6 afraid of 7 \nBecause 7 \"ate\" 9",
  "I want to die peacefully in my sleep like my grandfather. Not screaming and yelling \nlike his passengers",
  "What's red and invisible? \nNo tomatoes.",
  "Marge: \"Homer, you never listen to anything I say!\" \nHomer: \"Thank you. I would like an omlet.\"",
  "2 cows are in a field. \nthe first cow says \"hmm i feel a little bit sick\" \nthe second cow replies \"Shut up! or you'll get us both killed!\"",
  "what is the sleepiets fish? \na kipper",
  "A polar bear goes into a bar and says to the barman \"Could I have a pint of beer and \n................................................ a packet of crisps please?\". The barman says \"Certainly - what's with \nthe enormous paws (pause)?\"",
  "What do you call a cow that eats grass? \nA lawn moo-er",
  "2 robbers went 2 the gates of heven an angle said god there is 2 robbers at the gates \ngod said let them in so the angle went 2 let them in he came running in and said \"they're \ngone,they're gone,\"god:who the robbers no the gates!!",
  "Q: Why don't anteaters get sick? \nA: Because they're full of antibodies.",
  "A Texan is bragging, as usual: \n\"You know,\" he says, \"I can get in my Cadillac at 7 a.m., drive all day long and still be on my \nproperty.\" \n\"Yes,\" replies his listener, \"I had a car like that once.\"",
  "A man walks into a bar and hears someone say, \"Hey, you look NICE today!!!\" He turns \naroud and asks the bartender, \"Who said that?\" The bartender answers, \"The peanuts... \nthey're COMPLEMENTARY!!!\"",
  "Two sheep were standing on a hillside in Scotland, one looks up and says \n\"baaaaaaaaaa...\" The other says, \"Bloody hell, I was gonna say that!\"",
  "Q-When's the best time to have a tooth pulled? A- Tooth-Hurty",
  "A man walks into a pub, goes up to the bar \"Pint of best\" he says to the bar man. \nWhilst waiting for his drink he notices that Vincent Van Gogh is sitting at one of the tables He \ngoes up to him and says \n\"Are you Vincent Van Gogh?\" \n\"Yes\" the old man replies. \n\"do you want a pint Vincent?\" \n\"No, ta. I've got one `ere.\"",
  "A dog walks into a bar and says to the bartender, \"Hey bartender, it's my birthday! \nHow about a free drink?\" The bartender says, \"Sure pal, the toilet's down the hall.\"",
  "Sherlock Holmes and Dr Watson were going camping. They pitched their tent under \nthe stars and went to sleep. Sometime in the middle of the night Holmes woke Watson up. \n\"Watson, look up at the stars, and tell me what you see.\" Watson said, \"I see millions and \nmillions of stars.\" Homes: \"and from that you deduce?\" Watson: \"Well, if there are millions of \nstars, and in even a few of those have planets, its quite likely there are some planets like earth \nlike earth out there. And if there are a few planets like earth out there, there might also be \nlife.\" Holmes: \"Watson, you idiot, somebody stole our tent.\"",
  "What is the last thing a fish says when it hits a wall? \nDam!",
  "Did you here about the magic tractor ? \nIt was driving down a lane then it turned into a field !",
  "Where do you find a dog with no legs? \nWherever you left him.",
  "Three guys walk into an office building...you think one of them would of noticed it was \nthere...",
  "Two peanuts walk into a bar........... \nOne was a salted",
  "Apparently 1 in 5 people in the world are Chinese. And there are 5 people in my family, \nso it must be one of them. It's either my mum or dad, my older brother Colin or my younger \nbrother Ho-Cha-Chu. But I think its Colin",
  "What do you call a mushroom who buys you drinks all night? \nA real Fungi to be with.",
  "You know, somebody actually complimented me on my driving the other day. They left \na little note on my windscreen saying parking fine. So that was nice",
  "Q: Why did the egg cross the road? \nA: To research its geneology.",
  "Q.What did the monk say when returning to his monestary after a trip around the \nworld? A. The world is my cloister.",
  "Whats black and shiny and sails the seven seas? ....Binbag the sailor!",
  "What has more courage, a stump or a rock? A rock, because it's a little boulder.",
  "A neutron walks into a bar. He asks the bartender for a drink. \nWhen it's served, he asks how much it will be. \n\"For you,\" the bartender answers, \"no charge.\"",
  "News Flash from Chicago: Man found face down in bathtub full of milk and corn flakes \nwith banana in rear! Police looking for cereal killer.",
  "Two jelly babies walked into a bar with their friend the Hard Gum. When they went up \nto get drinks, some cough sweets went up to them and started hassling them. The jelly babies \nwere a bit scared and went to the Hard Gum to ask for a bit of help. He replied , \"I'm not going \nanywhere near them, they're menthol!\".",
  "A turtle was walking down an alley in New York when he was mugged by a gang \nof snails. A police detective came to investigate and asked the turtle if he \ncould explain what happened. The turtle looked at the detective with a confused \nlook on his face and replied \"I don't know, it all happened so fast.\"",
  "Q: Where does a King keep his armies? \nA: In his sleevies",
  "A woman walked into a bar and ordered a double entendre, so the barman gave her \none.",
  "Where do horses go when they are injured or hurt? \nThe Horsepital.",
  "It's a hot day, and everyone is on the beach. \nAnd it's strange, because everyone has bought an ice-cream cone, and is feeding the sea-gulls \nwith it; two gulls to each person. \nSo I went bought an ice-cream, and straight away the gulls came down to steal it. \nSo of course I chased them away, but they kept on coming, and then this old man wonders \nover in my direction. He's got an ice-cream, and two gulls eating it. And he says: \"You'll never \nstop them, so do what everyone else is doing: relax, enjoy yourself, and let the gulls have the \nice-cream.....\" \n\"Why?\" I asked. \n\"Because,\" he said, \"that way you'll be chilling two birds with one cone.\" \n(\"killing two birds with one stone\"... of course)",
  "Rene Descarte walks into a bar. \nBartender says, \"have a beer?\" \nDescarte says, \"I think...not...\" \nand disappears.",
  "why did the mouse squeak? \n'cos it needed oiling",
  "What do you get when you cross an elephant with a rhino? Hellifino.",
  "Q : Name 2 crustaceans \nA : King Crustacean & Charring Crustacean",
  "a brain and a set of jump leads walk into a bar, \"two pints of beer please \nbarman\" asks the brain \"sorry guys can't serve you tonight\" replies the barman \n\"why not\" asks the brain \"because you're out your head and he's likly to start \nsomthing\"",
  "I've heard that cardiovascular exercise can prolong life. Is this true? \nYour heart is only good for so many beats, and that's it. Everything \nwears out eventually. Speeding up your heart will not make you live \nlonger; that's like saying you can extend the life of your car by driving \nit faster. Want to live longer? Take a nap.",
  "Two spiders were playing football in a saucer. \nOne says to the other: \"I'm getting really bored with this.\" \nThe other says: \"Don't worry, we're playing in the cup next week.\"",
  "why can't you milk a mouse? \n'cos you can't get a bucket under it",
  "Inventions today: it's reported that a new kind of pillowcase has been invented, made \nout of cordurouy. \nIt's making headlines.",
  "This guy is walking past a wooden fence. On the other side of the fence is an asylum. \nThe inmates are all screaming at the tops of their lungs, \"Thirteen! Thirteen! THIRTEEN!!\" \nThe guy notices a small hole in the fence and his curiosity naturally gets the better of him. He \ntakes a peek and a finger suddenly pops out and jabs him in the eye. He yells in pain as the \ninmates start shouting, \"Fourteen! Fourteen! FOURTEEN!!\"",
  "What's red and sits in the corner? \nA naughty bus!",
  "Why did the chicken cross the road? \nTo get to the rooster on the other side.",
  "Two Bears in an airing cupboard, which one is in the army ? \nThe one on the tank !! \nboom boom",
  "A little boy mouse goes into a music shop and asks for a mouse-organ. \nThe shopkeeper says: \n\"That's a coincidence, we had a little girl mouse in here yesterday, asking for the same thing.\" \nThe mouse replies: \n\"That must have been our Monica.\"",
  "A doctor says to his patient, 'I have bad news and worse news'. \n'Oh dear, what's the bad news?' asks the patient. \nThe doctor replies, 'You only have 24 hours to live'. \n'That's terrible', said the patient. 'How can the news possibly be worse?' \nThe doctor replies, 'I've been trying to contact you since yesterday'.",
  "What do baby apes sleep in? \nApricots!",
  "Two hunters were walking through the woods. \nSuddenly, a naked lady stepped out of the brush and said, \"I'm game!\", \nso they shot her.",
  "Man1 \"My wife's gone to the West Indies.\" \nMan2 \"Jamaica?\" \nMan1 \"No she went of her own accord\":",
  "How do you keep your nose from running? \nTeach it to WALK!",
  "What can you eat in a Cyber Cafe? \nMicro Chips",
  "A young karate champion joined the Army. The first time he saluted, he killed himself.",
  "If I had a pet newt I would call him \"Tiny\", because he'd be my newt.",
  "If corn oil comes from corn, where does baby oil come from?",
  "A piece of string walks into a bar one day and asks for a beer. \nThe bar tender says, \"I'm sorry but we don't serve string in this bar.\" \nThe piece of string walks out and returns the next day asking for a beer. \nNo luck. The bar tender turns him away again, \"Sorry but we don't serve string in this bar.\"",
  "What was born to succeed? \nA budgie with a blunt beak!",
  "Why do gorillas have big nostrils? \nBecause they have big fingers!",
  "Doctor. Doctor. \"I've got a strawberry stuck up my bum.\" \nDoctor. \"I've got some cream for that.\"",
  "How much does a pirate pay to have his ear pierced? \nA Buccaner (buck an ear)",
  "A drunk was standing on a London Street corner shouting \"It can't be done! It can't be \ndone!\" Just ten, a Bobby aproached him and said: \"What can't be done?\" \nThe drunk answered, \"Look, up there on that sign, it says 'DRINK CANADA DRY.' It just can't \nbe done ...It's too Bloody big!!!\"",
  "A mother & daughter go out looking for Barbie Dolls, but can't find any prices in the \nshop, so they ask an assistant to help. \"This is Single Barbie, she cost 20, and this is Married \nBarbie, she costs 40, and this one is Divorced Barbie, she costs 250\", says the assistant. \n\"Why so much for the Divorced Barbie?\" ask the mother. \"Well, with the Divorced Barbie\" \nsays the assistant \"You get the House, the Car, the Children......\"",
  "Did you hear about the new restaurant on the moon? \n. \n. \n. \n. \nI hear the food is great, but the atmosphere is lousy.",
  "A newly married man asks his wife, \n\"Would you have married me if my father hadn't left me a fortune?\" \n\"Darling,\" the woman replies sweetly, \"I'd have married you no \nmatter who left a you a fortune.\"",
  "Mahatma Gandhi, as you know, walked barefoot most of the time, which \nproduced an impressive set of calluses on his feet. He also ate very \nlittle,which made him rather frail and with his odd diet, he suffered from \nbad breath. \nThis made him what?",
  "Two shepherds lean on their crooks at the end of a long \nday and the first asks the second, \"So, how's it going?\" \nThe second one sighed and shook his head, \"Not good, I \ncan't pay my bills, my health isn't good, my kids don't \nrespect me, and my wife is leaving me.\" \nThe first replied, \"Well, don't lose any sheep over it.\"",
  "James wanted to start a new hobby, and he decides he's going to learn a new flying \nsport. So he invites his friends to come and watch. \nHe takes them to the top of a cliff, and produces three bird cages - one containing a \nbudgerigar, the second containing a chicken, and the third a parrot. \n\"What *are* you up to?\" asked one of his friends. \n\"Well,\" said James, \"I couldn't decide between budgie-jumping, hen-gliding or parrot-\nshooting.... so I thought I'd try all three.\"",
  "He said 'I'm going to chop off the bottom of one of your trouser legs \nand put it in a library.' \nAnd I thought 'That's a turn-up for the books.'",
  "A piece of string walks into a pub and asks for a pint. \nThe barkeep says \"Get out. We don't serve pieces of string here.\" \nThe piece of string goes around the corner, ties a knot in his middle and unravels his ends. It \ngoes back into the bar and again asks for a pint. \nThe barkeep says \"Are you the same piece of string that was in here a minute ago?\" \nThe piece of string says \"I'm a frayed knot.\"",
  "World's best oxymoron: \nWindows Operating System",
  "Little Johnny watched, fascinated, as his mother gently rubbed cold cream on her face. \n\"Why are you rubbing cold cream on you face, mommy?\" he asked. \"To make myself \nbeautiful,\" said his mother. A few minutes later, she began removing the cream with a tissue. \n\"What's the matter?\" asked Little Johnny. \"Giving up?\"",
  "A man in a hurry taking his 8-year-old son to school, made \na turn at a red light where it was prohibited. \n\"Uh-oh, I think I just made an illegal turn!\" the man said. \n\"It's okay, Dad\" the boy said. \"The police car right behind \nus did the same thing.\"",
  "Did you hear about the new Barbie Doll they are making? It's called \"Divorced Barbie\". \nShe comes with all of Ken's things.",
  "Three men walk into a bar. The fourth one ducks.",
  "i went to the doctors the other day and [whilst raising my hand in the air] i say \"doctor \nit hurts when i do this\" \nthe doctor replies \"Well dont do it then\"",
  "Some tourists in the Chicago Museum of Natural History were marveling at the \ndinosaur bones. One of them asked the guard, \"Can you tell me how old the dinosaur bones \nare?\" \nThe guard replied, \"They are 3 million, four years, and six months old.\" \n\"That's an awfully exact number,\" says the tourist. \"How do you know their age so precisely?\" \nThe guard answered, \"Well, the dinosaur bones were three million years old when I started \nworking here, and that was four and a half years ago.\"",
  "two nuns walked into a building.......... you would have thought thay would have seen \nit!!",
  "Big Diet \n-well here's your plain popcorn, no salt, no butter. \n-Sounds good, it'll go great with my plain salt, no popcorn, no butter and my plain butter, no \nsalt, no popcorn.",
  "One day little Johnny was in his back yard digging a hole. His neighbor, seeing him \nthere, decided to investigate. \n\"Whatcha doin?\" he asked. \n\"My goldfish died and I'm burying him,\" Johnny replied. \n\"That's an awful big hole for a goldfish, ain't it?\" asked the neighbor. \n\"That's because he's inside your cat!\"",
  "Did you hear what happened to the hyena who swallowed an Oxo cube? \nHe became a laughing stock ...",
  "Went to the doctor and he told me i would have to take a pill every day for the rest of \nmy life. \nHe only gave me 4????",
  "\"Give me a sentence about a public servant,\" said a teacher. \nThe small boy wrote: \"The fireman came down the ladder pregnant.\" \nThe teacher took the lad aside to correct him. \"Don't you know what pregnant means?\" she \nasked. \n\"Sure,\" said the young student confidently. \"Means carrying a child.\"",
  "My wife and I were happy for 20 years. \nThen we met...",
  "A neurotic is a man who builds a castle in the air. A psychotic is one who lives in it. A \npsychiatrist is the one who collects the rent!",
  "Did you hear about the Invisible Man that married the Invisible Woman? Yeah, their \nkids aren't much to look at either.",
  "So these vultures decide to fly to Florida on an ariline. They got on board carrying six \ndead raccoons and the flight attendant says, \"I'm sorry, but there's a limit of two carrion per \npassenger.\"",
  "Question: How do you keep an idiot in suspense? \nAnswer: I will tell you later.",
  "\"Are you a lawyer?\" \n\"Yes.\" \n\"How much do you charge?\" \n\"A hundred dollars for four questions.\" \n\"Isn't that awfully expensive?\" \n\"Yes. What is your fourth question?\"",
  "what's brown and sticky? \nA stick.",
  "eskimo husband and wife in an igloo.they hear \"thump thump thump thump\"on the \nroof. the wife turns to the husband and says\" whats that noise?.He looks out the window and \nsays\" dont worry luv it's only rain dear\"(reindeer!)",
  "Why is one side of a \"V\" of geese always longer? \nBecause there are more geese on that side.",
  "Why does Windows make computers crash? \nBecause there's insufficent memory to RAM the door down! \n(I didn't expect you to laugh, this joke was...a joke!)",
  "Q: Did you hear about the magic tractor? \nA: It was going down the road and turned into a field.",
  "Why don't canibals like clowns? Because they taste funny!!!!!",
  "Why do canibals like missionaries? Because they give them a taste of christianity!!!!",
  "What do you call a musician who's girlfriend has dumped him? \nHomeless.",
  "A guy walks into a bar with a piece of tarmac and said to the bartender, \"Give me one , \nand one more for the road.\"",
  "A boy was walking down the street when he was stopped by a man holding a sofa.The \nman said to the boy \"Here you go you can have this sofa for nothing I don't need it anymore\" \nthe boy thanked him and took the sofa home to his dad.When he arrived home his dad went \nmad, the boy said to him \"Dad I thought you would be pleased\" his dad replied \"No son what \nhave I told you about taking suites off strangers\"!!!!!",
  "Q: Did you hear about the magic tractor? \nA: It was going down the road and turned into a field.",
  "A man walked into a bar and the barman said to him \"Hello do you want a drink?\" \"Yes \nplease\" replied the man.The barman then gave him a drink and waited for his money but the \nman didn't pay the barman argued with him and said \"Thats 3.00 please\" but the man \nreplied \"No you asked me if I wanted drink not if I wanted to buy one\" a lawyer sitting in the \ncorner agreed so the barman let him off and banned him from the pub.The next day the man \nwent back to the pub and the barman said \"Oi are'nt you the man I barred yesterday?\" \"No\" \nreplied the man, \"oh\" said the barman \"You must have a double\" \"Yes please said the man I'll \nhave a malt whiskey\" !!!!!!",
  "man #1: My dog has no nose \nman #2: then how does it smell? \nman #1: bad",
  "what is red and stands in the corner? \na naughty strawberry",
  "a group of 99 ostritches is standing around with their heads buried in the sand, an \nostritch runs up to join the group, looks around and says,\"Hey! Wheredid everyone go?\"",
  "Whats a wombat for? \nFor playing Wom.",
  "There are two parrots sitting on a perch. \nOne says to the other, \"Can you smell fish?\".............................!!!",
  "A duck walks into a bar, and asks the bartender: \"Got any grapes?\" \nThe bartender replies: \"This is a bar, not a market, we don't have grapes\"; \nThe duck walks out of the bar, only to return the next day; once again, the duck asks the \nbartender: \"Got any grapes\"? \nThe bartender says;\" look, I told you yesterday that we don't sell grapes here!\" \nThe duck leaves, but returns the next day, with the same question: \"Got any grapes?\". \nThe bartender angrily replies: \"look, I have already told you twice that we don't have any \ngrapes here. Now get out of the bar before I nail your little webbed feet to the floor!\". \nThe duck walks out, but comes back the next day. He asks: \"Got any nails?\" \nThe bartender replies: \"No, this isn't a hardware store!\". \nDuck says: \"Got any grapes?\"",
  "Whats the difference between a bison and a buffalo? \nYou can't wash in a buffalo",
  "There was three tomatoes walking down a street. The daddy tomato and the mammy \ntomato were way ahead of the baby tomato. The daddy tomato got so annoyed at the baby \ntomato for being so slow that he turned around real quickly and smacked his hands together \nand roared \"KETCHUP\" !!!!",
  "A polar bear goes into a pub and says to the barman: \"I'd like a.......................packet of salt \nand vinegar crisps please.\" The barman replies, \"Sure, but why the big pause?\"",
  "A three legged dog walk bursts into a wild west saloon and says \"I'm looking for the \nman who shot my paw\"",
  "A grasshopper walks into a bar. The bartender says \"hey! we've got a drink named \nafter you!\". The grasshopper says \"you have a drink named Murray?!\"",
  "a man buys two monkeys. those monkeys multiply and soon he's got 10 monkeys. the \ncity gets wind of it and threatens heavy fines if he doesn't get rid of the monkeys. So the man \ncalls his cousin pedro and offers him $50.00 to take the monkeys to the zoo. a couple of hours \npass, pedro calls and asks for fifty MORE dollars! the man says \"listen, i just gave you $50.00 \nto take them to the zoo\". Pedro says \"yes, but now they want to go to the movies!\".",
  "A guy is driving down the motorway, knitting. Obviously this is dangerous driving as \nthe driver has no hands on the wheel, so before long the police are catching up with him. \nOne police car drives up alongside the offending vehicle, and motions for him to open his \nwindow. \n\"pull over!\", the policeman shouts across. \n\"No - pair of socks!\"",
  "What do you call a mushroom who buys you lots of drinks? \nA fungi to be with!",
  "Who is a penguin's favourite relative. \nHis Aunt Artica!",
  "Q.Why was there a fish in the piano? \nA.Because it was a piano tuna",
  "Q.What do you get if you cross a bird a car and a dog? \nA.A flying carpet",
  "Q. What is white and walks through the desert? \nA. A herd of yoghurt",
  "Q. What's the difference between a tennis ball and the Prince of Wales?",
  "A guy tries to enter a nightclub but is stopped at the door by the bouncer who tells him \nthat he can't get in without wearing a necktie. The guy goes back to his car, looks around but \ncan't find a tie. He sees a set of jumperleads in the back so he puts them around his neck and \nties a rough knot. He walks back to the nightclub. When the bouncer sees him he looks him \nover and says \"OK you can go in - but don't start anything\"",
  "why did the fly do an old-fashioned dance on the jam jar? \nbecause it said \"twist to open",
  "what do you get if you cross a snowman with a vampire? \nFROSTBITE!!!",
  "Q. Where did Napoleon keep his armies? \nA. In his sleevies",
  "How do you kill a circus? \nGo for the juggler.",
  "A square and a circle walk into a bar. The square says to the circle, \"Your round!\"",
  "A linguistics professor was lecturing to his class. \n\"In English,\" he said, \"a double negative forms a positive. In some languages, though, such as \nRussian, a double negative is still a negative. However, there is no language wherein a double \npositive can form a negative.\" \nA voice from the back of the room piped up, \"Yeah, right.\"",
  "There's a sausage and an egg in a frying pan. The sausage turns to the egg and says: \n\"Gosh egg, it's really hot in here, isn't it?\" The egg turns to the sausage and says: \"Oh my god! \nA talking sausage!!\"",
  "A guy phones the local hospital and yells \"You've gotta send help! My wife's in labour!\" \nThe nurse says, \"Calm down. Is this her first child?\" He replies, \"No! This is her husband!\"",
  "What did the policeman say to his belly? \nYou're under a vest!",
  "Why did the chicken cross the playground? \nTo get to the other slide!!!",
  "Why do deep sea divers jump out of the boat backwards when they want to go into the \nwater? \nBecause if they jumped forward, they would fall into the boat.",
  "Q: What do you tell a mathematician on a Saturday night ?",
  "A PROFESSOR WAS GIVING ONE OF HIS LECTURES. IN THE MIDDLE OF HIS LECTURE \nA \nSTUDENT WROTE 'FOOL' ON A SLIP OF PAPER. HE THREW IT AT THE PROFESSOR. THE \nPROFESSOR STOPPED HIS LECTURE AND TAKING THE SLIP IN HIS HAND HE SAID 'WHICH \nOF THE GENTLEMAN HERE HAS SENT ME HIS VISITING CARD?'",
  "A mother-in-law sent two ties to her son-in-law. Some weeks later, she was invited for \nlunch, and so he wore one of them in the hope of pleasing her. The meal was a tense and \nuncomfortable one, with the Mother-in-law maintaining a stony silence. Finally she spoke. \n\"Alright, what's wrong with the other tie.\"",
  "What did the orange say to the banana on the street corner? \n\"Hi\"",
  "Wy was 6 afraid of 7? Because 7 ate 9.",
  "A family of tortoises went into a cafe for some ice cream. They sat down and were \nabout to start when father tortoise said , \"I think its going to rain, Junior, will you pop home \nand fetch my umberella?\"So off went Junior for father's umberella,but three days later he still \nhadn't returned. \" I think , dear,\" said mother tortoise to father tortoise,\"that we had better \neat Juniors ice cream before it melts.\" And a voice from the door said,\"If you do that I won't \ngo.\"",
  "what did batman say to robin before they got in the car? Robin, get in the car",
  "Q.: How do you catch a rhino wearing a wool-hat? \nA.: You kick it's back. Then let the rhino chase you around a lake until the rhino is hot and \ntakes off the hat. Now you can catch it like a normal rhino.",
  "There was a knock on the door in the early hours. The man went downstairs, opened \nthe door, and a voice said\"Will you give us a push, mate?\". The man was very angry, saying \nthat this was a ridiculous hour to be knocking people up, shut the door, and went back \nupstairs. When his wife asked who it was, he told her some nutter wanting a push. She \nsaid\"You shouldn't have refused him; don't you remember when we broke down and were \nglad of a push?\", so he went downstairs again, opened the door, and said\"OK,mate, where are \nyou?\" And a voice said \"Over here on the swings\".",
  "Why is a tree better than a guard dog? It has more bark!",
  "Two ducks were sitting in a pond, one of the ducks said \"Quack\" The other duck said \"I \nwas going to say that!\"",
  "What's black and white and black and white and black and white? \nA: A Penguin rolling down a hill.",
  "What did the small rug say to the large rug? Cover me I'm cold.",
  "old lady knocks down a cat as she drives along the main street \na police man comes along as she drives off. \nhe calls\" hey you can't leave that lying there. \nshe calls back thats not a lion it's a cat.",
  "How do telephones get married? They just give each other a ring.",
  "An engineer, a physicist, and a mathematician are on a train in Scotland. The engineer \nlooks out the window and sees a black sheep. He comments, \"Look, they have black sheep in \nScotland\". Then physicist looks and comments, \"From this observation, we can only say there \nis at least one black sheep in Scotland.\" The mathematician then looks and comments, \n\"Actually, from this we can only say there is at least one sheep in Scotland that's black on one \nside.\"",
  "A proton, neutron, and electron walk into a bar. The proton orders a drink, and asks \nhow much it costs. The bartender says, \"five dollars.\" Next, the electron orders a drink and \nasks how much it costs. Again the bartender says, \"five dollars.\" Finally the neutron orders a \ndrink and asks how much it costs. The bartender says, \"for you, there is no charge.\"",
  "What do chiropodists eat for breakfast? \nCornflakes! :)",
  "What happenend to the car mechanic that fell asleep dreaming about cars? \nHe woke up exhausted",
  "Why do birds sing and humming birds hum? Humming birds don't know the words.",
  "A businessman is hurrying home on the motorway after a hard days work when he is \nstopped by a policeman. 'Do you know you were driving 30 mph over the limit?' asks the \npoliceman. 'Eh, actuallly no, officer, it's a big car and it just sort of coasts along. . .you know. . .' \n'And what were you planning on doing if you met Mr Fog?' demands the policeman. 'Well,' \nsays the businessman, thinking it best to play along, 'I suppose I'd ease off on Mr accelerator, \nand switch on Mr headlights and Mr windscreen wipers'. The policeman leans in the window \nand eyeballs the businessman. 'I asked you what you were planning on doing if you met MIST \nOR FOG!' \nAnd threw the book at him.",
  "\"You're a high-priced lawyer! If I give you $500, will you answer two questions for \nme?\" \n\"Absolutely! What's the second question?\"",
  "teacher) \"Jonny why are you late for class\" \nJonny) \"well I was on my way to shool and I was almost here but thjen I crossed a sign \nsaying SLOW so I had to go really slow and that's what took me so long.",
  "What's green and sings? Elvis Parsley",
  "Q: Why do people say you never judge someone until you've walked a mile in their \nshoes? A: Because then when you do you'll be a mile away and have their shoes.",
  "What do you get if you cross a mammal with a reptile? A Nobel prize",
  "Q: What happens if you don't pay your exorsist.A: you get repossesed",
  "What has four wheels and flies? \nA garbage truck.",
  "Me: Ask me if I'm an orange! \nYou: Are you an orange? \nMe: No!",
  "What's the difference between a trampoline and a bagpipe? \nEventually you get tired of jumping on a trampoline.",
  "A mechanic, an engineer and a computer scientist are travelling together in a car, when \nthe motor suddenly fails. The mechanic and engineer each try various techniques to restart \nthe car... \"Pump the accelerator a couple of times\", says the mechanic. \"No,\" replies the \nengineer, \"turn the ignition key without touching the pedal...\" The car refuses to start. \nAfter the failure of several more attempts, the computer scientist confidently announced his \nsolution. \"Let's all get out of the car, then get back in.\"",
  "A patient walks into the doctors office and says doctor I have pain anywhere I touch \nmy body with my finger! The doctor says thats unusuall. So he tell her to touch her arm with \nher finger and she screams in pain. He tells her to touch her foot with her finger she yells in \naggony. He tells her to touch her leg with her finger and she screams. The doctor then goes to \nthe patient and says just as as I though your finger is broken!",
  "What's red and invisible? \nNo tomatoes.",
  "\"Thats a funny reptile you have whats its name?\" \n\"Tiny\" \n\"Why do you call it Tiny\" \n\"Because he is My Newt\"",
  "Police were called to a Pizza Hut in Leeds at the weekend after \nthe body of a worker was found covered in mushrooms, onions,",
  "Q:Why does an elephant paint its nails red? A: so it won't be noticed between the \nstrawberries. \nDoes it work? Well...ever seen an elephant between the strawberries?",
  "What is worse than finding a maggot in your apple? \n- Finding half a maggot in your apple.",
  "A man is driving down the road when he gets pulled over by a copper. The copper \ndraws a circle on the floor and asks the man to stand in it. While the man stands in the circle, \nthe copper gets out a hammer and smashes the cars headlights. The copper turns around and \nsees the man laughing! So the copper goes and smahes each of the cars windows. The copper \nturns around again and sees the man laughing even harder! The frustrated copper then \nshouts to the man, \"What the hell you finding so funny??\" The man replies, \"Everytime you \nturned around, i've been jumping in and out of this circle!!",
  "Q: What lies on the bottom of the ocean and quivers? \nA: A nervous wreck.",
  "A little babymouse is walking hand in hand together with her mother. \nSuddenly a bat comes flying in the air. \nThe little mouse point's at the bat saying: Look Mammi, an angel.",
  "What do you call a princess who worries all the time? A warrior princess.",
  "Did you hear about the Buddhist monk who refused to have his mouth frozen when he \nwent to the dentist? \nHe wanted to transcend dental medication.",
  "A man had a dog called minton. One day minton ate two shuttle cocks. When the owner \nfound out he said bad minton!!!!",
  "A guy takes a trip for a short holiday. His wife is on a business trip that is ending the \nnext day and she plans to fly down and meet him. When he arrives at his hotel he sends her a \nquick message. Unable to find the piece of paper on which he wrote her company e-mail \naddress, he does his best from memory. \nUnfortunately, he doesn't get it exactly right and the message is routed instead to someone \nwhose husband recently passed away. \nWhen the grieving widow opens her e-mail, she takes one look at her monitor, screams and \nfaints. \nThe message on the computer screen read: \nMy darling wife ... just checked in, everything is prepared for your arrival tomorrow. Looking \nforward to us being together again.",
  "I cut the bottom off one of my trouser legs the other day and sent them to the library. \nWell theres a turn-up for the books.",
  "Sherlock Holmes and Dr Watson went on a camping trip. After a good meal and a \nbottle of wine they lay down for the night, and went to sleep. \nSome hours later, Holmes awoke and nudged his faithful friend. \"Watson, look up at the sky \nand tell me what you see.\" \nWatson replied, \"I see millions and millions of stars.\" \n\"And what does that tell you?\" \nWatson pondered for a minute. \"Astronomically, it tells me that there are millions of galaxies \nand potentially billions of planets. Astrologically, I observe that Saturn is in Leo. \nHorologically, I deduce that the time is approximately a quarter past three. Theologically, I \ncan see that God is all powerful and that we are small and insignificant. Meteorologically, I \nsuspect that we will have a beautiful day tomorrow. What does it tell you?\" \nHolmes was silent for a minute, then spoke. \"Watson, you pillock! Someone has stolen our \ntent!\"",
  "A guy walks up to the receptionist in the Physchiatrist's office and says \"I'm the \nInvisible man and I'd like to talk to the Doctor\". She pokes her head into the Physchiatrist's \noffice and says there is a man here who wants to talk to you and he claims he's the Invisible \nman. The Physchiatrist replies \"Tell him I can't see him right now\".",
  "What's black, white, blue, and purple all over? \nA zebra with a bruise!",
  "An unemployed jester is nobody's fool.",
  "Was that wig expensive? How much did you have toupee for it?",
  "A neutron walks into a bar and orders a drink. When he asks the bartender how much \nhe owes him, the bartender says, \"For you, it's no charge.\"",
  "What do you call a Swiss Financier on the Paris Undergound? \nA metronome.",
  "Why did the chicken cross the road? \nTo show the possum that it COULD be done.",
  "Two men are hired to do a job in a building. After the owner explains everything, he \nleaves. When he returns a while later, he sees one man working diligently and the other man \nhanging on the ceiling, singing \"I'm a chandelier, I'm a chandelier.\" The owner orders him to \ncome down and get back to work. A while later the owner returns to find the one working \ndiligently and the other back on the ceiling, singing \"I'm a chandelier, I'm a chandelier\" again.",
  "A group of dentists decided to set up a new surgery. Since competition in their area \nwas quite fierce, they wanted their new business to have something unique about it. \nAfter much thought, they decided to set up shop on board a boat, moored on the banks of the \nriver. As an added bonus, they also offered river crossings in the boat, with the dentistry work \nbeing performed during the crossing. \nThe business quickly became known as the Tooth Ferry.",
  "A group of astronaughts are on the moon. They've been mining the surface, and have \ndiscovered that it really is made of cheese. \nOne particular area of cheese that they're quite interested in is a large vein of brie, and \nthey've already been there twice, and collected samples to be returned to mission control. \nAll of a sudden, the radio crackles into life: \"Mission control to cheese-base-one - we need you \nto get a third load of that brie!\" \nBut the astronaughts are unhappy with the idea. They try to come up with all sorts of excuses \nwhy they shouldn't dig any more... \n\"It'll spoil the environment if we take too much. We don't want to leave this place looking \nbad... \n\"After all - have you ever seen such a site in your life as brie mined thrice?\"",
  "Once a village bum went on an airplane for the first time. After some turbulence the \nvillage bum asked the man sitting next to him to open the window so he can throw up. The \nman told him the window cannot be opened so the village bum started beating up the man. \nSoon a flight attendant came and asked him the reason for his behaviour. After listening to his \ncomplaint the flight attendant told him about the barf bag. After a while the flight attendant \ncame and saw all the passengers barfing. Since the village bum was the only one not throwing \nup the flight attendant asked him what had happened. To this the village bum replied that as \nhe was throwing up everyone stared at him so being embarassed he drank it back.",
  "Q. What do you call a woman who can balance 4 pints of beer on her head? \nA. Beatrix",
  "Why are seagulls called seagulls? \nBecause if they flew over the bay, they'd be bagels.",
  "What did the snail say while riding on the turtles back? \nWHEEEE!!!",
  "early one morning a gentleman was doing his push up exercises in central park when a \ndrunk came along and tapped him on the shoulder and said \"say mister i think your \ngirlfriends gone home\"",
  "I had a dream that i was a muffler last night. I woke up exhausted.",
  "Why can't an Engineer tell a joke timing.",
  "Why din't the tedy bear finish its dinner? it was stuffed.",
  "An American, an Australian and a Japanese man become stranded on a tropical island. \nThe American decides to take charge and says. \n\"I'll be in charge of engineering\" he then looks at the Australian and says \"You can be in \ncharge of building\" and finally looks at the Japanese man and says \"You're in charge of the \nsupplies\". They all wander off into the jungle and all except the Japanese man return a few \nhours later. Months go by and the Australian and American have made do without the \nJapanese man and have built a rigid bamboo hut. Finally, on the horizon a Navy helicopter \nappears and lands of the beach, the Australian and American joyfully run up to it. Suddenly, \nthe Japanese man jumps out from behind a palm tree and screams \"SUPPLIES!!\"",
  "What makes God laugh? \nAns: People making plans.....",
  "Dave: Me and the missus went to the Caribbean this year for our summer holidays. \nJohn: Jamaica? \nDave: No, she went of her own accord!",
  "Q: Why do elephants drink? \nA: To try and forget",
  "A black man walks into a store with a parot on his shoulder. the clerk ask where he got \nhim from. the parot said, \"Africa, there is a whole bunch of them down there.\"",
  "What do you call a boomerang that doesn't come back? \nA stick.",
  "What do you call a fly with out wings? A walk",
  "How do priests make holy water? \nThey boil the hell out of it.",
  "A male ostrich was chasing two female ostriches. The one female said to the other, \n\"He's starting to gain on us, we better hide!\" So, they stopped and stuck their heads in the \nsand. The male ostrich said, \"...Hey, where'd they go?\"",
  "A 3 legged dog walks into a bar and says \"Who shot my paw?\"",
  "A string walks into a bar, and the bartender says \"We don't serve strings here\". So the \nstring goes into another bar, and the bartender says \"We don't serve strings here\". So the \nstring goes into ANOTHER bar, and the bartender says \"We don't serve strings here\". \nThe string gets all mad, so he pulls and ruffles himself all up.",
  "When NASA first started sending up astronauts, they quickly discovered that ballpoint \npens would not work in zero gravity. To combat the problem, NASA scientists spent a decade \nand $12 billion to develop a pen that writes in zero gravity, upside down, underwater, on \nalmost any surface including glass and at temperatures ranging from below freezing to 300C. \nThe Russians used a pencil.",
  "Descartes walks in to a bar. The bartender ask if he'd like a beer. Descartes replies, \"I \nthink not.\" Then he disapears.",
  "A fish walks into a bar and the bartender says what will it be. The fish replies water!",
  "A depressed horse walks into a bar. The barman asks him, \"Why the long face?\"",
  "A man goes to a psychiatrist and says, \"Doc, you gotta help me. I've been having the \nstrangest dreams. Last night I dreamed I was a teepee, and the night before I dreamed I was a \nwigwam. What do you think it means?\" The doctor pondered a moment and replied, \"Well, it \nsounds like you're two tents.\"",
  "two peanuts walk down the street and one was a salted.",
  "Q. what did the male volcano say to the female volcano? \nA. do you lava me like i lava you!",
  "A new teacher was trying to make use of her psychology courses. \nShe started her class by saying, \"Everyone who thinks they're \nstupid, stand up!\" After a few seconds, Little Johnny stood up. \nThe teacher said, \"Do you think you're stupid, Little Johnny? \nLittle Johnny replied, \"No, ma'am, but I hate to see you \nstanding there all by yourself.\"",
  "Q: why did the football coach go to the bank ? A: to get his quarterback!",
  "Did you hear about the ship that ran aground carrying a cargo of red paint and black \npaint? The whole crew was marooned.",
  "How many surrealists does it take to change a light blub? \nTo get to the other side.",
  "Why didn't the Clam share his candy? Because he was Shellfish",
  "What is the difference between ignorance, apathy, and ambivalence? I don't know and \nI don't care one way or the other.",
  "A Philosopher and scientist were being chased by a lion. The Scientist looked back and \nmade a swift calculation. Puffing, he said to the philosopher - 'we can't out run it you know' \nThe Philosopher was slightly ahead, he replied 'I am not trying to outrun the lion, I am trying \nto out run you!",
  "Charles Dickens walks into a bar and orders a Martini. Bartender asks \"Olive or \nTwist?\"",
  "Why can't dalmations play hide and seek? Because they are always spotted.",
  "An inebriate enters a restaurant and asks the cashier, \"Did you see me come in the \ndoor, there?\" \n\"Yes I did, sir.\" \n\"Have you ever seen me before?\" \n\"No, I haven't.\" \n\"Then, how did you know it was me?\"",
  "What do you call a one legged ballarenia's costume? A One-One",
  "A doctor says to his patient,\"Without these treatments, you've got 3 months to live,\" \nand hands him a bill. \nThe patient says, \"My God! Look at all these. I can't come up with this kind of money in 3 \nmonths!\" \nThe doctor says, \"Alright! You've got 6 months to live.\"",
  "How do you make a cat go woof? \nPour petrol on it.",
  "A swede(vegetable) walks in to a library and the librarian looks up and says \"There's a \nturnip for the books\"",
  "If Sondra Locke married Elliot Ness, divorced him and married Herman Munster, she'd \nbe Sondra Locke Ness Munster.",
  "A guy goes to the doctor and complains he can't stop singing the \"Green, Green Grass \nOf Home\". \nThe doctor says it's the Tom Jones Syndrome \nThe guys asks if it's common. \nThe doctor replies: \"It's not unusual\"",
  "\"Doctor, I used to think I was a dog, but I reckon I'm cured now-wow-wow!\" \n\"I see. How long did you have this complaint?\" \n\"Ever since I was a puppy.\" \n\"Interesting. Well, just lie on the couch there.\" \n\"But I'm not allowed on the couch...\"",
  "Q: What is big, grey and sings the Blues? \nA: Elephant Gerald.",
  "What's yellow and stupid? Thick custard!!!!!",
  "Knock Knock \nWho's there ? \nBoo \nBoo who \nDont cry",
  "If I eat three cakes in the morning and three for tea... what will I have/ \nAnswer: A tummyache",
  "A pirate walks into a pub. Another patron, having never met a pirate before, wants to \nknow the stories behind the battle scars. He buys the pirate a pint, and strikes up a \nconversation. \n\"How'd you get the peg leg?\" \n\"Shark took off me leg in the South Seas.\" \n\"How about that hook?\" \n\"Lost the hand in a sword fight.\" \n\"And the eye patch?\" \n\"Seagull pooped in me eye.\" \n\"Are seagull droppings really that dangerous?\" \n\"No, but it were me first day with the hook.\"",
  "A man goes into a pub and sees his best friend playing chess with a dog. \nHe says \"That's a very clever dog you've got there!\" to which his friend replied, \"He's not that \nclever, he doesn't often win!\"",
  "A magician is very happy because he has got a job on the Titanic.So he gets on the ship, \nand that night he does his act in front hundreds of people but doesn't get very far for his \nparrot keeps giving away the answers\"It's under the table.It's up his sleelve.It's behind his \nback.\" The magician goes off the stage very depressed, and this happened again and again and \nagain until one night, unfortunaly, the ship hit an ice-berg and sank!Luckily, the magician and \nhis parrot escaped in a lifeboat.They sailed on and on for days without seeing anyone, and \nthrough all of this time, the parrot had a look of total confusionon his face and didn't utter a \nsingle word.The magician thought that the parrot must be sick of hunger, until one day when \nthe parrot said. \n\"O.K. I give up.Where have you hidden the stupid ship???!!!!\"",
  "A man is driving to work and is called on his mobile. It's his boss saying he's been \npromoted. The man is so happy his car wobbles in the road. A little while later there is \nanother phone call and he's been promoted again. He is so happy he swerves into the middle \nof the road and back into his lane. Later there is another phone call. For the 3rd time he is \npromoted. He is so overwhelmed with joy that he swerves off the road and bangs into a tree.",
  "why did the mermaid blush because the seaweed!",
  "Why did the muddy chicken cross the road twice? \nAnswer: He was a Dirty Double-Crosser!",
  "Why did the dog cross the road twice? \nAnswer: He was trying to fetch a boomerang!",
  "Why does a moon rock taste better than an earth rock? A moon rock's a little meteor.",
  "There's this guy with a wooden eye. He's very sensitive about it, so he doesn't get out \nmuch. One day, he sees an ad for a dance, and he decides to go. He gets there, and he sees an \nattractive young lady with a gigantic nose. He thinks to himself \"Well, she has that huge nose. \nMaybe she'll be more accepting of my wooden eye.\" He walks over to her and says \"Would \nyou like to dance?\" She replies \"Oh! Wouldn't I!\" He shouts \"Big nose! Big nose!\"",
  "Guy is sitting in a bar. A beautiful woman walks in. She's a knock-out and he can't take \nhis eyes off her. She notices him and smiles. She sashays over and sits beside him. She looks \ninto his eyes and tells him, \"For $200 I'll do anything you want.\" He's astounded. \"Anything?!\", \nhe asks her. \"Yes, _anything_!\", she replies. He takes out his wallet and slaps $200 on the bar. \n\"Here's $200. Paint my house!\"",
  "A man came home from golfing one Saturday a little later than he usually did. His wife \nasked him why. \n\"Bob had a heart attack and died right there on the 9th hole!\" he explained. \n\"Oh, my goodness, how horrible!\" she exclaimed. \"No wonder you're late!\" \n\"Yeah,\" he said. \"For the whole rest of the course, it was 'hit the ball, drag Bob, hit the ball ...'\"",
  "someone was walking in street & carrying a rabbit, another one met him & ask: How \nmuch does this donkey cost? the man reply: it is not a donkey it is a rabbit, the another said: I \ndidn't ask you I'm asking the rabbit :))",
  "Whats the differance between a shark and a lemon? \nThey both swim, except for the lemon.",
  "What's blue and square? a banana in disguise",
  "A mother put her child to sleep and then went to the kitchen. She then saw her son and \nhe asked, \"Can I have a glass of water?\" The mother gave him a glass and he back upstairs. \nMinutes later the boy returned asking for a glass again. The mother wondered what could \nmake her child so thirsty and when he came back down asking for another glass of water, the",
  "What is the leading cause of dry skin? \nTowels",
  "A man walks up to the main desk a library and says in a loud commanding voice to the \nlibrarian, I'll take two hamburgers, no mayonnaise, and an order of fries. The librarian looks \nup at him, shocked. Summoning up all the testy authority she can, she says to him, Sir, this is a \nlibrary! \nThe man pauses for only a split second and then leans over close to her, cups his hand over \nhis mouth so as to direct his voice only to her ear, and whispers, I'll take two hamburgers, no \nmayonnaise, and an order of fries.",
  "what goes haha bonk? a man laughing his head off!",
  "\"Doctor!\" said the patient. \"I keep seeing spots before my eyes.\" The \nphysician scratched his head, \"Why have you come to me? Have you seen an opthalmologist?\" \n\"No,\" replied the patient, \"just spots.\"",
  "Two televisions walk into a bar and the barman says \"sorry, we don't serve your kind \nin here\", and one television turns to the other and says \"we're not getting a great reception in \nhere\"",
  "Why did the projector blush? \nBecause it saw the film strip.",
  "Two penguins are sitting in a bathtub. The first one asks the second one to pass him \nthe soap. The second one says, \"What do you think I am, a typewriter?\"",
  "Why are chickens considered good employees? Because they work around the cluck.",
  "In a dark night, under a street lantern, someone seeks after a lost key. Another helps \nseeking, and after half an hour on their knees, the other asks: \"Are you really sure that you \nlost your key right at this place?\". The one answers: \"No, I lost it further down the road, but \nhere the lightning is better!\".",
  "A young lad came home after his first day at school was asked by his mother how did \nhe enjoy his first day at school. He told her that the other kids were teasing him. They kept \nlaughing and calling him big head. His mother told him to ignore them. She also told him that \nthere was nothing wrong with his head. She then asked him to go the store and get ten \npounds of potatoes. He asked her what could use to carry them in. She replied ---- use your \nhat.",
  "Why aren't elephants allowed on the beach? They can't keep their trunks up.",
  "How do you keep an idiot in suspense? \nI'll tell you later...",
  "An elephant and a mouse were talking together. \nThe elephant said to the mouse, \"Why am I so big and strong and heavy and you are so tiny, \nweak and puny and grey?\" \nThe mouse said, \"Well, I've been ill haven't I!\"",
  "Customer: Waiter, there's a fly in my soup. \nWaiter: There can't be. We used them all in the raisin bread....",
  "To Tell the weather, \nGo to your back door and look for the dog. \nIf the dog is at the door and he is wet, it's probably \nraining. But if the dog is standing there really soaking \nwet, it is probably raining really hard. \nIf the dog's fur looks like it's been rubbed the wrong way, \nit's probably windy. \nIf the dog has snow on his back, it's probably snowing. \nOf course, to be able to tell the weather like this, you \nhave to leave the dog outside all the time, especially if \nyou expect bad weather. \nSincerely, The CAT",
  "A group of managers were given the assignment to measure the height of a flagpole. So \nthey went to the flagpole with a ladder and measuring tape.They keep falling off the ladder, \ndropping the tape and the whole thing is in a mess. An engineer comes along and sees what \nthey are trying to do. He walks over, pulls the flagpole out of the ground, lay it flat, measures \nit from end to end, gives the measurement to one of the managers and walks away. After the \nengineer left, one manager turns to another and laughs. ''Isn't that just like an engineer? We \nare looking for the height and he gives us the length!''",
  "A husband stepped on one of those penny scales that tell you your fortune and weight \nand dropped in a coin. \n\"Listen to this,\" he said to his wife, showing her a small, white card. \"It says I'm energetic, \nbright, resourceful and a great person.\" \n\"Yeah,\" his wife nodded, \"and it has your weight wrong, too.\"",
  "A man walks into a pub and sees Vincent Van Gogh sitting in the corner. \n\"Fancy a pint Vincent?\" he asks \n\"No thanks,\" Van Gogh replies, \"I've got one 'ere.\"",
  "Man walks into a bar and immediately notices two pieces of meat nailed to the ceiling. \n\"What's with the meat?\", he asks the barman.",
  "A man goes to the doctors and says 'I have a problem doc, I can't say my 'f's, my 't's or \nmy 'h's. The doctor says 'well you can't say fairer than that'.",
  "Q. What have an orange and a parrott got in commom? \nA. Neither of them can drive a tractor.",
  "Two oranges are walking down the road. The one orange says to the other, \n\"So, where do you live then?\" and the other replies, \n\"I'm not telling you, you'll nick my washing off the line!\"",
  "son to mother \"there's a man at the door with a bill\" \nmother to son \"don't be silly it must be a duck with a hat on\"",
  "Why are elephants big, grey and wrinkled? Because if they were small, white and \nsmooth they would be aspirin.",
  "Did you hear about the man that was walking down the street and turned into a hotel?",
  "A frog telephones a psychic hotline and is told: \"You are going to meet a beautiful \nyoung girl who will want to know everything about you.\" \"Great!\" says the frog. \"Will I meet \nher at a party?\" \"No,\" replies the psychic. \"Next year, in a biology class.\"",
  "Q: How many pragmatists does it take to change a lightbulb? \nA: One.",
  "A man goes into a pet shop to buy a parrot. The shop owner points to three identical \nlooking parrots on a perch and says: \n\"The parrot to the left costs 500 dollars\". \n\"Why does the parrot cost so much?\" the customer asks. \nThe owner says, \"Well, it knows how to use a computer.\" \nThe customer asks about the next parrot and is told \"That one costs 1,000 dollars because it \ncan do everything the other parrot can do plus it knows how to use the UNIX operating \nsystem.\" \nNaturally, the increasingly startled man asks about the third parrot and is told \"That one costs \n2,000 dollars.\" \nNeedless to say this begs the question \"What can IT do?\" \nTo which the owner replies \"To be honest I have never seen it do a thing but the other two \ncall him boss!\"",
  "How do you keep an elephant from charging? \nTake away his credit card!",
  "What did the necktie say to the hat? \nYou go on a head and I'll just hang around.",
  "Two statisticians when duck hunting. Not being very good, they did not see a duck all \nday. Just as they agreed to leave, a duck flew out in front of them. Both aimed and fired. One \nshot went two metres to the left of the duck, the other two metres to the right, and the duck \nescaped. However, they went home very happy, because on average the bird was dead!",
  "A man and a friend are playing golf one day at their local golf course. One of the guys is \nabout to chip onto the green when he sees a long funeral procession on the road next to the \ncourse. He stops in mid-swing, takes off his golf cap, closes his eys, and bows down in prayer. \nHis friend says, \"Wow, that is the most thoughtful and touching thing I have ever seen. You \ntruly are a kind man.\" The man then replies, \"Yeah, well we were married 35 years.\"",
  "What do you call a mystic midget who has just escaped from prison? A small medium \nat large.",
  "Two cows in a field. \nOne turns to the other and says \"Are you worried about this Mad Cow Disease?\" \nThe other cow says \"Non, je suis Napoleon\"",
  "If at first you don't succeed, Skydiving isn't the sport for you.",
  "One dark foggy night, I was walking alone on a narrow country road when out of the \nfog appeared a small car moving very slowly - and with no sound! I jumped to the side of the \nroad but as it drew level, it stopped! Through the windows I could see no-one - no driver, \nnothing. I looked closer and then opened the passenger door(I was on that side)and braced \nmyself to climb in.Immediately the car started to move again, just as slowly! I froze, kneeling \non the seat clutching its back.Moments later the car stopped and I almost fell out.As I \nscrambled to my feet, the ghostly, shambling figure of a man drifted towards me out of the fog \nand I screamed out \"Oh, god, there's something wrong about this car!\" \nThe shadowy figure stopped.It gasped, and then a voice croaked \"I know, I've been pushing \nit for half a mile!\" .",
  "Two farmers are standing by a fence. One of them asks the other: \n- Do your cows smoke? \n- No... \n- No? Then I suppose your barn is on fire.",
  "a man walks into a butchers shop: \nman: a pound of kidleys please. \nbutcher: what? \nman: I said a pound of kidleys!",
  "How do you get a philosopher off your porch? \nPay for the pizza.",
  "What do u call a gingerbread man with only one leg?? Limp Biscuit",
  "Q. What do Cats like to eat for breakfast?. \nA. Mice-Krispies",
  "How many punk rockers does it take to change a light bulb? Two, one to change the \nbulb and one to kick the chair out from underneath him.",
  "Q. What do you give dead bread? \nA. A toast-mortem",
  "Two television aeriels met on top of a roof and fell in love, and soon decided to get \nmarried. The service was terrible - but the reception was brilliant!",
  "Where does a policeman live?",
  "letsbe avenue.",
  "knock knock \nwho's there? \nAlison \nAlison who? \nAlison Wonderland",
  "What do you call a nun with a washing machine on her head? \nSister Matic",
  "Two elderly gentlemen were talking. One says, \"Boy, this new hearing aid I got works \ngreat! I can hear everything now.\" The other one says, \"That's wonderful! What kind is it?\" \n\"It's a quarter past two.\"",
  "Q. Why is television called a medium? \nA. It is neither rare nor well-done.",
  "A large hole appeared in the High Street this morning. The police are looking into it.",
  "A couple are out touring a house that they want to buy with a realtor when they ask \nthe realtor, \"The house is very nice, but is this a quiet neighborhood?\" \nThe realtor answers, \"Sure, there have been six murders, seven robberies, and no one heard a \nthing.\"",
  "Time flies like the wind. Fruit flies like a banana.",
  "If miss universe is not fixed then why are all the winners from earth",
  "Bacon and eggs walks into a bar, and the bartender says \"Sorry, we don't serve \nbreakfast\".",
  "What did one snake say to another? \n\"Mum, are we supposed to be poisonous?\" \n\"No son, why?\" \n\"Because I just bit my lip!\"",
  "A business owner has just moved places and was reopening soon. A friend of his \nwanted to cocratulate him so he went to the local florist and asked if he could have some \nflowers delivered to the man. He then asked the florist worker to write something clever to go \nwith the flowers. A few days later the florist receives phone call. It was the boss. \"I am sure \nthere was a muck up in your delivery service, my flowers came but it said: Rest In Peace on it\" \n\"Well I'm sorry\" was the reply \"But you think of these mourners at a funeral at the moment \nwith flowers with a card saying: Congratulations on your new place\"",
  "what should you do if you get snow in your mouth? \nJust grit your teeth!",
  "A husband and wife were having a fine dining experience at their exclusive country \nclub when this stunning young woman comes over to their table, gives the husband a big kiss, \nsays she'll see him later and walks away. \nHis wife glares at him and says, \"Who was that?!\" \n\"Oh,\" replies the husband, \"she's my mistress.\" \n\"Well that's the last straw,\" says the wife. \"I've had enough, I want a divorce. I am going to \nhire the most aggressive, meanest divorce lawyer I can find and make your life miserable.\" \n\"I can understand that,\" replies her husband, \"but remember, if we get a divorce it will mean \nno more wintering in Key West, or the Caribbean, no more summers in Tuscany, no more \nCadillac STS in the garage, and no more country club, and we'll have to sell the 26-room house \nand move to two smaller homes, but the decision is yours.\" \nJust then, a mutual friend enters the restaurant with a gorgeous young woman on his arm. \n\"Who's that with Jim?\" asks the wife. \n\"That's his mistress,\" says her husband. \nThe wife replies, \"Ours is prettier.\"",
  "I collect badgers. One day I'll have the full set.",
  "What time did the Chinaman go to the dentist \nTooth hurty",
  "A monstery falls on hard times so 2 monks decide to open a FISH & CHIP bar.On the \nfirst day of opening a woman comes in and sees one of the monks peeling spuds, so she says \nto him, \"You must be the chipmonk\", he replies,\"No, I'm the friar\"!!",
  "Jesus decided to help St. Peter at the Pearly Gates. \nA very old man approached and Jesus asked him,\"How have you lived your life?\" \nThe old man replied,\"I was a carpenter.\" \nJesus looked closely at the old man. \n\" Is it, is it....you, father?\" \nThe old man peered back at him. \n\"Is it you, Pinocchio?\"",
  "Couple goes to a psychiatrist. Woman says, \"Doc, my husband thinks he's a dog. Can \nyou help him?\" Shrink says, \"Sure, have him lie down on the couch.\" Woman says, \"Oh no. \nHe's not allowed on the couch.\"",
  "A man walks into a bar with a piece of tar mac under his arm. He says to the bar man \" \na pint for me and one for the road\".",
  "A man was walking in the country and saw a pig with a wooden leg sitting outside a \nbarn. As he was pondering this, the pig's owner came along. The man asked the farmer how \nthe pig got his wooden leg. \nThe farmer said, \"Let me tell you, that is some pig! Our house caught fire last May, and he \ndragged my kids to safety!\" \n\"Is that how he lost his leg?\" the man asked. \n\"No,\" replied the farmer. \"But a month ago, I almost drowned and that pig swam through icy \nwater to pull me to shore!\" \n\"So that's how he lost his leg,\" the man asked. \n\"Oh, no. And just a week ago, my wife's car slid off the road onto the train tracks. That pig \nbroke through the window and helped her out just as a freight train came through!\" \n\"So THAT'S how he lost his leg!\" the man said. \n\"No, sir.\" \n\"Then HOW did he lose it?\" the man begged. \n\"Well sir,\" the farmer replied, \"when you got a pig that terrific, you don't want to eat it all at \nonce.\"",
  "A duck walks in to a postoffice and asks the postman: \"Do you have any corn?\" The \npostman answers politely: \"No, we don't have any corn here.\" The next day the duck enters \nthe store again and asks: \"Do you have any corn?\" A bit annoyed the postman answers: \"No! \nWe don't have any corn.\" This goes on for a couple of days. Finally one day when the duck \nasks:\" Do you have any corn?\", the postman gets so upset he yells: \"NO! For the last time, we \ndon't have any corn, and if you ask again, I'll nail your beak to the counter!!\" The next day the \nduck returns to the store and asks: \"Do you have any nails?\" The postman answers:\" No.\" \nThen the duck asks:\" Do you have any corn?\"",
  "A teacher was taking her class for a walk in the woods.",
  "Mum:Come on,John,eat your breakfast;you`ll be late for school. \nJohn:I don`t want to go to school.The teachers don`t like me,the children don`t like me-even \nthe caretaker doesn`t like me! \nMum;All the same, you must go. \nJohn:Why should I go? \nMum:Well,for one thing you`re forty five years old,and for another your the headmaster.",
  "There are two teddy bears in the airing cuboard. which one is in the army? \nAnswer:The one on the tank.",
  "How do you confuse an idiot? \nPurple!!",
  "Q. Why is Toblerone triangular? A. So it will fit in the box.",
  "Q: What do John the Baptist and Winnie the Pooh have in common? \nA: The same middle name!",
  "Did you hear about the Hamster found dead in his cage?.... Apparently he fell asleep at \nthe wheel!",
  "One afternoon a little boy was playing outdoors. He used his mother's broom as a \nhorse and had a wonderful time until it was getting dark. He left the broom on the back porch. \nHis mother was cleaning up the kitchen when she realized that her broom was missing. She \nasked the little boy about the broom and he told her where it was. She then asked him to \nplease go get it. The little boy informed his mom that he was afraid of the dark and didn't \nwant to go out to get the broom. His mother smiled and said 'The Lord is out there too, don't \nbe afraid'. The little boy opened the back door a little and said 'Lord if you're out there, hand \nme the broom'.",
  "Joan, the town gossip and supervisor of the town's morals, recently accused George, a \nlocal man, of being an alcoholic because she saw his pickup truck parked outside the town's \nonly bar. \nGeorge stared at her for a moment, and said nothing. \nLater that evening, he parked his pickup truck in front of her house and left it there all night.",
  "There was a lawyer and he was just waking up from anesthesia after surgery, and his \nwife was sitting by his side. \nHis eyes fluttered open and he said, \"You're beautiful!\" and then he fell asleep again. His wife \nhad never heard him say that so she stayed by his side. \nA couple minutes later his eyes fluttered open and he said \"You're cute!\" Well, the wife was \ndisappointed because instead of \"beautiful\" it was \"cute.\" \nShe said, \"What happened to 'beautiful'?\" \nHis reply was \"The drugs are wearing off!\"",
  "Give a man a fish and he will eat for a day. Teach him how to fish and he will sit in a \nboat and drink beer all day!",
  "\"This day holds a lot of meaning for me. It was on this day two years ago that I lost my \ndear wife and children. I'll never forget that game of cards....\" \n- Anon.",
  "After a trial had been going on for three days, Finley, the man accused of committing \nthe crimes, stood up and approached the judge's bench. \n\"Your Honor, I would like to change my plea from 'innocent' to 'guilty' of the charges.\" \nThe judge angrily banged his fist on the desk. \"If you're guilty, why didn't you say so in the \nfirst place and save this court a lot of time and inconvenience?\" he demanded. \nFinley looked up wide-eyed and stated, \"Well, when the trial started I thought I was innocent, \nbut that was before I heard all the evidence against me.\"",
  "Our supermarket had a sale on boneless chicken breasts, and a woman I know \nintended to stock up. At the store, however, she was disappointed to find only a few skimpy \nprepackaged portions of the poultry, so she complained to the butcher. \n\"Don't worry, lady,\" he said. \"I'll pack some more trays and have them ready for you by the \ntime you finish shopping.\" \nSeveral aisles later, my friend heard the butcher's voice boom over the public-address \nsystem: \"Will the lady who wanted bigger breasts please meet me at the back of the store.\"",
  "Sean got home in the early hours of the morning after a night at the local pub. He \nmade such a racket hitting into the furniture as he weaved his way through the house, that he \nwoke up the missus. \n\"What on earth are you doing down there?\" she yelled down from the bedroom. \"Get yourself \nup here to bed and don't waken the neighbours.\" \n\"I'm trying to get a barrel of Guinnes up the stairs\" he shouted. \n\"Leave it 'till the morning\" she shouted down \n\"I can't\" he said \"I've drank it!\"",
  "A group of kindergarten children were on a class outing to their local police station \nwhere they saw pictures, tacked to a bulletin board, of the 10 most wanted men. \nOne of the youngsters pointed to a picture and asked if it really was the photo of a wanted \nperson. \n\"Yes,\" answered the policeman.",
  "While making his rounds, a doctor points out an X-ray to a group of interns. \"As you \ncan see the patient is limping because his left fibula and tibia are radically arched. Michael, \nwhat would you do in a case like this?\" \"Well,\" said the intern, \"I suppose I'd limp too.\"",
  "A man commits suicide. In one of his pockets, the police find an envelope. Inside the \nenvelope is a note that reads: \"What are you looking in here for?\"",
  "A worried Mrs. Melchnik sprang to the telephone when it rang and listened with relief \nto the kindly voice in her ear. \n\"How are you, darling?\" it said. \"What kind of a day are you having?\" \n\"Oh, mother,\" said the housewife, breaking into bitter tears, \"I've had such a bad day. The \nbaby won't eat and the washing machine broke down. I haven't had a chance to go shopping, \nand besides, I've just sprained my ankle and I have to hobble around. On top of that, the \nhouse is a mess and I'm supposed to have two couples to dinner tonight.\" \nThe mother was shocked and was at once all sympathy. \"Oh, darling,\" she said, \"sit down, \nrelax, and close your eyes. I'll be over in half an hour. I'll do your shopping, clean up the \nhouse, and cook your dinner for you. I'll feed the baby and I'll call a repairman I know who'll \nbe at your house to fix the washing machine promptly. Now stop crying. I'll do everything. In \nfact, I'll even call George at the office and tell him he ought to come home and help out for \nonce.\" \n\"George?\" said the housewife. \"Who's George?\" \n\"Why, George! Your husband! ....Is this 555-1374? \n\"No, this is 555-1375.\" \n\"Oh, I'm sorry. I guess I have the wrong number.\" \nThere was a short pause and the housewife said, \"Does this mean you're not coming over?\"",
  "did you hear bout the three eggs.. two bad",
  "What you call a snowman with a sun tan? \nA puddle!",
  "If atheletes get athelete's foot, what do astronauts get? \nMissile toe!!",
  "Ted: I had the worst dream last night. I dreamed I ate a 2-ton marshmellow. \nSteve: What's wrong with that? \nTed: When I woke up my pillow was gone",
  "The scene is a butcher's shop \nCustomer: \"I'd like a pound of kidleys, please\" \nButcher: \"Surely you mean kidneys, madam\" \nCustomer: \"I said kidleys, didle I!\"",
  "I was offered a job in a monastery laundry.",
  "Why do seagulls live by the sea? \nIf they lived by the bay they woul be called bagels!",
  "Q: How many many balls of wool would it take to reach the moon. \nA: One, but it would need to be very large.",
  "A man rushes into the doctors and says \"Doctor doctor you've got to hep me I think I'm \na pair of curtains\". The doctor replies \"Oh pull yourself together\".",
  "What do you call a big white bear with a hole in his middle? \nA polo bear.",
  "Why was the back end of a horse walking down the road? \nBecause the front end was.",
  "What do you call a chicken in a shellsuit? \nAn egg!",
  "How is a lawyer different than and angry chicken? \nThe angry chicken \"clucks defiance\"!",
  "ME: doctor doctor, I've only got 50 seconds to live! \nDOCTOR: Just a Minute",
  "A man walks into a butcher's shop and asks the butcher \"Have you got a sheep's \nhead?\". \"No\", replies the butcher, \"it's just the way I part my hair\".",
  "why did the blind chicken cross the road? \nTo get to the birds eye shop!",
  "There were two boys called manners and shut up. Shut up went to the sweet shop and \nmanners went to the fish and chip shop. The shop keeper said to shut up. What's your name \nand shut up said shut up. The shop keeper said that's not nice where's your manners. In the \nfish and chip shop said shut up.",
  "Docter docter I swallowed a camera? \nLets hope nothing serious develops",
  "What is square and blue? \nAn orange. I lied about it's shape and colour !",
  "A couple comes up to a wishing well. The guy leans over, makes a wish, and throws in a \npenny. \nHis wife decides to make a wish, too, but she leans over too far, falls into the well, and drowns.",
  "This guy runs home and bursts in yelling, \n\"Pack your bags sweetheart, I've just won the lottery, all six numbers!\" \nShe says, \"Oh wonderful! Should I pack for the beach or the mountains?\" \nHe replies, \"I don't care...just pack & shove off!\"",
  "Ariel and Times New Roman walk into a bar. The Barman takes one look and says, \n\"Sorry fella's, we don't serve your type in here\"",
  "Tell a man that there are 400 billion stars, and he'll believe you. Tell him a bench has \nwet paint, and he has to touch it.",
  "What do you call a man with seagulls flying around his face? \nCliff",
  "What do you get when you play a country song backwards? \nYou get your dog back, your wife back, your house back, and you sober up",
  "What do you call a women who can juggle with beer? \nA. Beertrix",
  "Did you hear about the dyslexic devil worshipper? Sold his soul to Santa.",
  "A cross and hungry panda went into a bar and, without ordering a drink, demanded a \nbowl of free bar-snacks. The bartender refused: \n\"Those snacks are for paying patrons.\" So the panda grabbed the nearest bowl, gobbled up \nall the snacks. Then he pulled out a revolver, shot the bartender dead, and stalked out. \nThe patrons all asked each other \"Who was that masked maurader?\" The quiet little guy at \nthe end of the bar calmly answered: \n\"That was a panda. He eats shoots and leaves.\"",
  "What is the difference between a duck? \nOne of its legs is both the same!",
  "A man went to a pet shop and said \"I'd like to buy some wasps please.\" The shop \nkeeper said, \"I'm sorry, we don't sell wasps.\" \"Well I saw three of them in the window!\" \nreplied the man.",
  "A bloke handed his mate an octopus that looked to be at death's door, and said \n\"There's the six quid I owe you\".",
  "Early morning in december 1968 a journalist calls Lyndon B. Johnson and asks what \nhe most wishes for Christmas. Johnson is desperately trying to make his drowsy brain work. \nBedazzled he tries to think of something adequate but not too exaggerated. Next morning The",
  "One day, a HR woman was hit by a bus and killed. Her soul arrived in heaven and she \nwas met by St.Peter. \n\"Welcome to Heaven. Before you get settled in, it seems we have a problem. We've never once \nhad HR manager make it this far. What we're going to do is let you have a day in Hell and a \nday in Heaven, then you can choose your eternity\" said St.Peter. \nSt.Peter put her in an elevator, it went down-down-down. The doors opened, she stepped \nonto a beautiful golf course. In front of her were all her fellow HR professionals. They were all \ndressed in evening gowns. They ran up and kissed her. They played golf and she enjoyed \nsteak and lobster dinner. She met the Devil who was a really nice guy, she had great time \ntelling jokes and dancing. When it was time to leave, everyone shook her hand and waved \ngood-bye. \nSo she spent the next 24 hours lounging around on the clouds, playing the harp and singing. \n\"Now you must choose your eternity\" he said. She paused and then replied, \"Well, Heaven has \nbeen great but I think I had a better time in Hell.\" \nSo she went down-down-down. When the doors opened, she was standing in a desolate \nwasteland covered in garbage. Her friends were dressed in rags and were picking up garbage \nfor the evening meal. The Devil came up to her and put his arm around her and laughed. \n\"I don't understand,\" she stammered. \"Yesterday I had great time here, there was a golf \ncourse and we ate lobster. Now all there is a wasteland and all my friends look miserable.\" \nThe Devil looked at her and grinned, \"that's because yesterday we were recruiting you, but \ntoday you're staff.\"",
  "What's the last thing to go through a bug's mind after it hits the windshield of a car? \nIt's rear end!",
  "what happens when monsters have a beauty contest? \nno-one wins!!!",
  "A small man jumped on a table in a bar and yelled: \n- Show me an irishman, and I'll show you a coward! \nA huge, bodybuilder looking guy stood up, walked to the little man and said: \n- Here's an irishman. \nThe little guy darted out of the door and yelled over his shoulder: \n- And here goes the coward!",
  "what did the traffic light say to the car. \ndon't look now I'm changing.",
  "A guy walks into a doctor's office with a strawberry growing out of his head. \nThe doctor says \n\"Don't worry - I've got cream for that\".",
  "A guy walked into a psychiatrist's office wearing only cling-film underpants.",
  "How is the new furniture store doing? \nSofa so good!",
  "Is it okay to kiss a nun? \nYes but dont get into the Habit!",
  "Why should you take care of your grandparents in an Indian restaurant? \nIn case your Nan slips into a Korma!",
  "What's orange and sounds like a parrot? \nA carrot",
  "Little Johnny is working away furiously in the woodwork room when the teacher \nenters. \"what are you making there, Johnny?\" he asks, \"a portable\" replies Johnny. The \nteacher looks puzzled, \"a portable what?\". Johnny replies \"I don't know yet Sir, I've only made \nthe handles!\"",
  "Teacher: Dude, what do you call a cock that has a bad eye? \nPupil: A cock-eyed bird.",
  "knock knock \nWho's there? \nThe ever interrupting cow. \nThe ever int... \nMOOO.",
  "whats the fastest milk in the world ? pasturised (past-ur-eyes(d))",
  "why did Jim bring his car into school? Because he wanted to drive his teacher up the \nwall!!!!",
  "two knights went into a hotel and said to the woman at reception 'i would like a room \nfor two nights!!!!'",
  "A husband and wife are traveling by car from Key West to Boston. After almost \ntwenty-four hours on the road, they're too tired to continue, and they decide to stop for a rest. \nThey stop at a nice hotel and take a room, but they only plan to sleep for four hours and then \nget back on the road. \nWhen they check out four hours later, the desk clerk hands them a bill for $350. \nThe man explodes and demands to know why the charge is so high. He tells the clerk that \nalthough it's a nice hotel, the rooms certainly aren't worth $350. When the clerk tells him that \n$350 is the standard rate, the man insists on speaking to the manager.",
  "A scientist and a philosopher were being chased by a hungry lion. The scientist made \nsome quick calculations, he said \"its no good trying to outrun it, its catching up\". The \nphilosopher kept a little ahead and replied \" I am not trying to outrun the lion, I am trying to \nout run you\"!",
  "Near dawn in a colony of Vampire bats, all are still hungry but one hangs there with \nblood on its face. They all pester and nag \"well it's alright for some! why don't you share this \ngreat feeding place with the rest of us?!\" only to get told \"Really, you dob't wadt to gnow\" \nwhich does nothing to calm them down so finally they are led off along the hedge and over the \npastures to a big tree in the middle of a field, where usually there are cattle to feed from. \nFlying round and round the tree they are again getting angry as there are no cattle to be seen, \nbut the bloody-nosed bat just says \"You all thee dis tree dob't you, well I dibn't!\".",
  "A man walks into a pub where everybody else is having coffee with cream. \n\"I would like a coffee. No cream on it.\" \n\"Sorry, we ran out of cream. Could it be with no milk?\"",
  "What do you call a person who used to like tractors a lot? \nAn ex-tractor fan !!",
  "A woman gives birth and it is just a head with no body or limbs. the father decides to \nlove it and give it the life that it deserves. he takes it to the park and loves it as if it was a \nnormal child. on his 18th birthday the father decides to take him down to the pub to give him \nhis first ever drink. 'give me a shot of absythe' the father asks the landlord. the drink is \npoured and the son drinks it down. suddenly a body pops out of the head. the father is \namazed. 'give him another!' the father exclaims. the son drinks and arms pop out. 'Another!' \ncries the man. then the son has all his limbs. he is stumbling around the bar, after all he has \nnever used them before. he stumbles outside and is promptly run over by a bus. the barman \nturns to the father and says ' he should have quit while he was ahead!'",
  "Two farmers are standing at a fence talking. \nFarmer 1: Do your cows smoke cigarettes???",
  "why did the skeleton cross the road? to get to the body shop.",
  "A man on holiday in India soon finds out about a monastery, high in the hills, \nthe only way to get to it is to take a half hour ride in a basket, being hoisted \nup the cliff face. The man decides this would be an adventurous thing to do, so \nhe goes and asks the monk at the bottom of the cliff weather he can get a lift \nup, the monk agrees and they begin the journey. About halfway through, the man \nnotices that the rope that basket is hoisted up on is very frayed, fearful, \nhe asks the monk \"how often does this rope get replaced?\" The monk thinks on \nthis for a few seconds and replies \"Whenever it breaks.\"",
  "What do you get when you cross a penguin with a centipede? - Cold feet.",
  "PATIENT: Doctor, doctor. I've come up in spots like cherries on a cake. \nDOCTOR: Ah, you must have analogy.",
  "Why did the dog go to bingo? \nSo it could Winalot!",
  "What's the black stuff between elephant's toes? SLOW ANTS.",
  "A frog goes into a bank walks up to the teller whose name is Pat Wack. He says \"Good \nMorning Miss Wack, my name is Kermit Jagger and I want to take out a loan for $10,000.\" She \nlooks at him curiously \"Do you have any collateral?\" He holds up a pink china elephant \"This \nis my collateral\". \"Just a moment please\" she says \"I'll have to see the Manager\". She goes into \nthe Manager's office and says \"There's a frog outside whose name is Kermit Jagger - he wants \na loan of $10,000 and all he can raise as collateral is a pink china elephant. Surprised, he looks \nat her and replies \"Nicknack Patty Wack give the frog a loan - his old man's a Rolling Stone\".",
  "There was a young fellow who lost an eye in a farm accident. Coming from a poor \nfamily, the best his parents could manage was a home-made wooden eye to fill the void. \nBeing self conscious he felt it unlikely he would ever find a girlfriend. Finally, after much \nencouragement, he decided to attend a dance. After looking over the girls in attendance, he \nnoticed a girl who had a very large nose sitting alone. Figuring she if anyone would be \nunderstanding about his wooden eye, he decided to ask her to dance. Crossing the floor he \nsaid \"Would you like to dance?\" The happy girl leaped to her feet and squealed \"Would I? \nWould I?\". He shouted back at her \"Big nose!! Big nose!!\".",
  "A guy walks into a bar carrying a giraffe. He sets the giraffe down by the door and \nwalks up to the bartender. \"Bartender, give me a whisky,\" he says. The bartend looks at him \nand says, \"You know, you can't just leave that lyin' over there.\" \nThe guy looks at him and says gruffly, \"It's not a lion, it's a giraffe.\"",
  "A Hunting Trip \nTroy's all excited about his new rifle. So he goes bear hunting in Alaska. The first bear he \nsees is a little brown bear, and he kills it with his first shot. There is a tap on his shoulder, and \nhe turns around to see a big black bear. \nThe black bear says \"You've got two choices. One, I maul you to death or Two, we have sex.\" \nTroy bends over for the bear. He's sore for 2 days, but he recovers and \nvows revenge. \nTroy heads out on another trip to Alaska and he finds the black bear and \nkills him. At that moment there is a tap on his shoulder. A huge \ngrizzly is standing right behind him. \nThe grizzly says, \"That was a big mistake. You've got 2 choices, \n\"Either I maul you to death or we have sex.\" \nTroy bends over. He survives, but he's really hurting and takes quite a \nbit of time to recover, and, he's outraged. \nSure enough, he heads back to Alaska and finds the grizzly and shoots \nhim at point blank range. There's a tap on his shoulder. He turns \naround to find an enormous polar bear. \nThe polar bear says, \"Hey, pal, you're not really coming up here for the \nhunting, are you?\"",
  "Why was Cinderella such a bad football player? \nHer coach was a pumpkin.",
  "What do call a doll with sausages on her head? \nBarbie.",
  "Man comes home from work to find boy next door digging big hole in lawn.Asks boy \nwhy. \"Well I'm burying my goldfish Mr.\" Man says \"I'm sorry about your fish but why do you \nneed such a big hole?\" Boy replies \"Well it's inside your cat!\"",
  "A farmer goes out one winter morning to find that all his cows are frozen solid where \nthey stand. While he is wondering what to to, he sees a figure approaching slowly across the \nfields. It is a little old lady; she looks at the cows, then works her way around the field, \nrubbing the nose of every cow in turn. \nSlowly, each cow starts to warm up and come back to life. The old lady rubs the nose of the \nlast cow and resumes her path across the fields. \nThe farmer stands amazed as his cows start to move around again. At this moment his \nbrother comes out to see what is going on - the farmer explains what has happened and \npoints out the little old lady as she disappears into the distance. \n\"Ah, well\", says the brother, \"you know who that is, don't you? Thora Hird!\".",
  "A man went into a pet shop and said \"I'd like to buy a fly please\". \nThe shop keeper said \"I'm sorry sir we don't do flies\". \n\"Well there was one in the window yesterday!\"",
  "You can take a horse to water, but a pencil must be lead.",
  "Why did the chicken cross the road? \nTo get to the other side. \nWhy did the rooster cross the road? \nHe was glued to the chicken. \nWhy was the rooser glued to the chicken? \nThey ran out of tape.",
  "what do you call a dog with no legs \nAnser. a hotdog",
  "Q:what do you get if you mix a cow with a camel ??? \nA:Lumpy milkshakes",
  "What's the difference between roast beef and pea soup? \nYou can roast beef but you can't pea soup!",
  "A man and wife were eating in a very exclusive restaurant when a georgeous woman \ncame up to the table, pur her arm around the man and gave him a kiss , and said 'I'll see you \nlater.' \nThe wife said 'Who is that?' to which he replied 'That's my mistress. \nThe wife then said 'I want a divorce, because that is just too much.' \nHe replied that it was up to her, but pointed out that there would no longer be a Lexus in the \ngarage, shopping in Paris or skiing in Gstaad. \nJust then one of their friends came in to the restaurant with a georgous woman on his arm. \nThe wife asked 'Who's that with Bob? and her husband replied 'Oh, thats his mistress.' \nThe wife looked again and said 'Ours is prettier!'",
  "An Insurance Assesor is at a wedding reception, and asks the bride; \"So this is your \nfourth husband?\", \"yes, that's right\", she replied. \"Can I ask what happened to your first \nhusband?\". \"Oh, very sad, he died quite suddenly\". \"Oh, I AM sorry, what happened?\". \"He \nunfortunately ate some poisoned mushrooms and passed away. The insurance paid out, of \ncourse, but it can never really compensate\". \"That's terrible, what happened to the second \nhusband?\". \"Another tragic case, he too, ate some poisoned mushrooms and passed away. The \nmoney didn't compensate for his loss\". By now, the Assessor was very suspicious, and asked; \n\"Did your third husband die from ingesting poisoned mushrooms?\". \"Oh no\", she stated, \"He \ndied from a fractured skull!\". \"My word, I AM VERY sorry... How did he get that?\". \"Well, he \nwouldn't eat the mushrooms!!!!\"",
  "A snail is on the bar one Christmas, and asks the barman \"Excuse me, can I have a pint \nof beer please?\". The barman says \"You WHAT?\". \"May I have a pint of beer, please?\" repeats \nthe snail. \"Don't be so stupid, snails don't drink beer\" snarls the bar man and sweeps the snail \noff the bar on to the floor. \nThe following Christmas, in the same bar, a snail appears on the counter. The barman asks \n\"What do you want?\", whereupon the snail shouts \"What did you do THAT for?\" !!! \n(Not as good as my poisoned mushroom joke!)",
  "A rabbit went into a butchers shop and said, \"Got any carrots?\" The butcher said, \"No!\" \nThe rabbit went back to the butchers the next day and said, \"Got any carrots?\" The butcher \nsaid, \"No!\" \nThe rabbit went back the next day and said, \"Got any carrots?\" The butcher said, \"No! And if \nyou come back tomorrow and ask if I have any carrots I'll nail your ears to the ceiling!\" \nThe rabbit went back to the butchers the next day and asked, \"Got any nails?\" The butcher \nsaid, \"No!\" The rabbit said, \"In that case, have you got any carrots?\"",
  "What do you call an Earl who is awarded an OBE? \nAn earlobe.",
  "What was the film about referees called? \nA) The umpire strikes back.",
  "Q. What do you call 100 penguins in TrafalgarSquare? \nA. Lost",
  "What do you call a fish with no eyes? \nFsh!",
  "Q: What's red & white on the outside, grey & white on the inside? \nA: Campbell's Cream of Elephant Soup.",
  "A man walks up to the bar with an ostrich behind him, and as he sits, the bartender \ncomes over, and asks for his order. The man says, \"I'll have a beer,\" and turns to the ostrich. \n\"What about you?\" \"I'll have a beer too,\" says the ostrich. The bartender pours the beer and \nsays \"That will be $3.40 please,\" and the man reaches into his pocket and pulls out exact \nchange for payment. \nThe next day, the man and ostrich come again, and the man says \"I'll have a beer,\" and the \nostrich says, \"I'll have the same.\" \nOnce again the man reaches into his pocket and pays with exact change. This becomes a \nroutine until, late one evening, the two enter again. \"The usual?\" asks the bartender. \"Well, it's \nclose to last call, so I'll have a large scotch\" says the man. \"Same for me,\" says the ostrich. \n\"That will be $7.20,\" says the bartender. Once again the man pulls exact change out of his \npocket and places it on the bar. The bartender can't hold back his curiosity any longer. \n\"Excuse me sir. How do you manage to always come up with the exact change out of your \npocket every time?\" \n\"Well,\" says the man, \"several years ago I was cleaning the attic and found an old lamp. When \nI rubbed it a Genie appeared and offered me two wishes. My first wish was that if I ever had to \npay for anything, I just put my hand in my pocket, and the right amount of money will always \nbe there.\" \"That's brilliant!\" says the bartender. \"Most people would wish for a million dollars \nor something, but you'll always be as rich as you want for as long as you live!\" \"That's right! \nWhether it's a gallon of milk or a Rolls Royce, the exact money is always there,\" says the man. \nThe bartender asks, \"One other thing, sir, what's with the ostrich?\" The man replies \"My \nsecond wish was for a chick with long legs.\"",
  "A woman went to a seance and was successful in contacting her husband. \nHi,\" he said,\" it's me. Everything's better... sky is bluer... grass is greener \nNothing to do but eat and sleep all day.\" \"Oh, thank goodness. You did get to Heaven.\" \n\"Heaven?. I'm a buffalo in Montana!\"",
  "From the deepest, darkest jungles of deepest, darkest Africa comes the cry of the \nSandwich bird - \"Eat me, Eat me\".",
  "What's gray on the inside and clear on the outside? An elephant in a baggie!",
  "What's green and likes snow? \nSki-weed",
  "my dog minton ate all my shuttlecocks.....badminton",
  "A man walks into a greengrocers and says \"Can I have a hammer please?\". The \nassistant says \"Sorry this is a greengrocers.\" The man replies \"That's O.K. I've got my bike \noutside.\"",
  "A priest conducts a service in a church \"The person who puts the most in the church \ncollection box can choose three hymns\" he says.The collection box comes back to him after \nbeing filled up and he finds that someone has donated a thousand pounds \"who has donated a \nthousand pounds?\" he asks.A women raises her hand . The priest invites her to the front and \ntells her to choose three hymns.Pointing at the three most handsom men in the church she \nsays \"I'll have him,him and him\"",
  "What's yellow and always pints north? A magnetic banana!",
  "Q-How do you hide an elephant? \nA-Paint its toenails red and stick it in a cherry tree. \nQ-Have you ever seen an elephant in a cherry tree? \nA-See, it works!",
  "Two kids were talking in the playground.The first kid says, \"My mum is from Ireland \nand my dad is from America. That makes me an Irish-American\". \nThe second kid says,\"Well my mum is from Iceland and my dad is from Cuba.So I \nguess that makes me an Icecube\".",
  "What did the robot say to the petrol pump? \nTake your finger out of your ear when I'm talking to you!",
  "Farmer Fred has an American farmer visiting him. The American farmer is boasting \nabout the size of his land in the United States: \n\"My land is so big, that it takes me two hours to drive around it by car.\" \nFarmer Fred is silent for a while. Then he nodds and says:",
  "what do you call a fish with three eyes ? \nfiiish.",
  "what did the green man turn red? so would you if you had to change in the street",
  "Bill happened by his neighbor's house one day. He saw his friend, farmer John in the \napple orchard holding his favorite, prize pig. John would patiently hold Snooks up so she \ncould munch an apple right off the twig, then move on to the next apple and the next. \"Hello, \nJohn,\" says Bill, \"not to interfere with your pastime but whyn't ya pick Snooks a bucket of \nthem apples...it would save time!\" \n\"Eh'yeah, Bill, it would...but then...what's time to a pig!\"",
  "\"He said 'I'm going to chop off the bottom of one of your trouser legs and put it in a \nlibrary.' I thought 'That's a turn-up for the books.\"",
  "A man left for a vacation to Jamaica. His wife was on a business trip and was planning \nto meet him there the next day. When he reached his hotel, he decided to send his wife a quick \ne-mail. \nUnable to find the scrap of paper on which he had written her e-mail address, he did his best \nto type it in from memory. Unfortunately, he missed one letter, and his note was directed \ninstead to an elderly preacher's wife whose husband had passed away only the day before. \nWhen the grieving widow checked her e-mail, she took one look at the monitor, let out a \npiercing scream, and fell to the floor dead. \nAt the sound, her family rushed into the room and saw this note on the screen: \nDearest Wife, \nJust got checked in. Everything prepared for your arrival tomorrow. \nYour Loving Husband. \nP.S. Sure is hot down here.",
  "A greyhound is sitting in pub, drinking its beer when the door opens and a horse \ncomes in. It sits down beside another horse and starts to talk of its troubles. \"Same as before, \nDes\" says the horse \"I get to within a hundred feet of the winning post and I fall over\". The \nother horse commiserates, \"That happening to all of us flat racers, Red. It must some sort of \ndisease\" The dog interrupts \"I can't believe it!, that's exactly what happened to me at \nWhitecity yesterday\". \nThe horses look at each in surprise; \"Will you look at that. A talking dog!\"",
  "A man sees an ad for a joke contest in his local newspaper so he sends in ten puns. He \ngets a letter back from the newspaper thinking he win, but no pun in ten did.",
  "Why is 6am like a pigs tail? \nBecause it's twirly!",
  "A horse walks into a bar and the bar man says, \"Hey we have a whiskey named after \nyou\"!! The Horse says, \"What.....Fred\"!!",
  "Q: how do you tell if an ant is a male ant or a female ant. \nA: drop it in water, if it floats it's boy-ant!",
  "Q. Why can't a rope? \nA. Because it can knot",
  "What do you call a judge with no thumbs? \nJustice Fingers",
  "How elephants can you get in a mini? Two in the front and two in the back! How do \nyou know if there's been an elephant in the fridge? There's footprints in the butter! How do \nyou know if there's been two elephants in the fridge? There's two footprints in the butter! \nHow do you know there's been three elephants in the fridge? There's three footprints in the \nbutter! How do you know if there's been four elephants in the fridge? There's a mini parked \noutside!!",
  "I joined an origarmi club, but it folded.",
  "What is ET short for? \nSo that he fits in his spaceship. \n.",
  "What do you get when you sit under a cow? A pat on the head.",
  "what do you get hanging from apple trees? \n.....sore arms!",
  "What is a crocodile's favourite card game? snap",
  "why can't you play poker in the jungle? because there is too many cheeters",
  "A visitor to a small country town noticed an old man playing chess. \nOn closer inspection he saw that a dog was sitting opposite the old man and the dog was \nmoving the chess pieces. \nThe visitor asked the old man if the dog was playing chess and he replied \"yes\". \n\"That must be one exremely intelligent dog\" said the visitor. \n\"Not really\" said the old man, \"I win more games than he does!\".",
  "If a pig loses its voice, is it disgruntled?",
  "When the wheel was invented, did it cause a revolution?",
  "A man walks into a barbers shop.He says\"I want to buy a comb\".\"Steel one \"says the \nbarber\".No I want to pay for it",
  "How many mystery crime novel writers does it take to change a lightbulb? \nOne, but he has to give it a really good twist.",
  "Tonto and the Lone Ranger are riding through the desert when they spy a small town \non the horizon. Its a cold desert night and the Lone Ranger fancies a whiskey or two to warm \nhim up so they stop into a saloon. The barman is happy to serve the Lone Ranger but refuses \nto serve Tonto. \n\"Sorry Tonto, but I really want this drink\" says the Lone Ranger, \"would you mind waiting \noutside for a little while?\" \n\"But it cold outside\" says Tonto. \n\"Well, run up and down to keep yourself warm\" says the Lone Ranger. \nSo the Lone Ranger has his whiskey and Tonto goes outside and runs up and down to keep \nhimself warm. A few minutes later another cowboy walks into the bar, struts up to the Lone \nRanger and demands: \"Are you the Lone Ranger?\". \n\"Yes\" the Lone Ranger replies. \n\"Well you left your injun running\".",
  "A man was going to bed one night when there was a knock at the door, he answered \nand there stood a giant ANT that punched him in his eye. Now he made up and excuse when \nhis friends asked him, because he thought he couldn't say he had been punched by an ant, so \nhe said he had had a punch up in the pub. Anyway the next night the same happened again, \nbut this time he got beaten up really bad, so he went to the hospital and told the doctor \neverything that had happened and the doctor said \"AHHHH yes there is a nasty bug going \nround.\"",
  "A man walks into the doctors and says: \n\"I think I'm Schizophrenic\" \nThe doctor replies \n\"That makes 4 of us!\"",
  "Apparantly 1 in 4 people in the world are Chinese. \nThere are 5 people in my family - this means that it is either my Mother, my Father, my \nYounger Brother Colin or ny Older Brother Ho Cha Chin. \nBut I think it is Colin!",
  "A man goes into the doctors he says ' doctor doctor I feel like a dog' the doctor says 'sit \non the couch I'll be with you in a minute' the man says 'I'm not allowed'.",
  "A man went into a pet shop and said: \"I would like a pet parrot for my daughter.\" and \nthen the owner of the pet shop said: \"sorry, this is a pet shop, we don't do swaps!\"",
  "Why do ducks have webbed feet? \nTo stamp out fires.",
  "How do you get two whales in a car? \nDrive down the M4!",
  "Man: Doctor, Doctor I feel like a goat!! \nDoctor: How long have you been feeling like this? \nMan: Ever since I was a kid!!",
  "A tomato, a faucet, and a lettuce decided to have a race. Who won? \nAt the finish, the lettuce was a head, the tomato couldn't ketchup, and the faucet was still \nrunning.",
  "An noble aristocrat was captured during the French Revolution. The captors said, \n\"Tell us the names of the people you are hiding!\". \"I won't say a word!\" says the aristocrat. \nThey place his head in the guillotine. \"Talk to us or die!\". \"I will not!\" he replies. They then \ndraw the blade to the top of the guillotine. \"Last chance to talk!\". \"Never!\" cries the Count. \nThen, just as they release the blade, the Count screams, \"Wait, wait, I'll talk!\". But, alas, it was \ntoo late. \nThe moral of the story: Never hatchet your Counts before they chicken!",
  "Q: How much did the pirate pay to get his ear pierced? \nA: A buccaneer",
  "Why didn't the watermellon marry the honeydew? \nBecause they cantalope!",
  "Why did they only make one Yogi Bear? They made a Boo Boo of the second.",
  "What is the difference between a tire and a bench? \n- None, they're both made of wood. Except the tire.",
  "As migration approached, two elderly vultures doubted they could make the trip \nsouth, so they decided to go by airplane. When they checked their baggage, the attendant \nnoticed that they were carrying two dead racoons. \"Do you wish to check the raccoons \nthrough as luggage?\" she asked. \"No, thanks,\" replied the vultures. \"They're carrion.\"",
  "My sister is reacting very slowly. Last week trhis guy wanted to take advantage of her \nand before she could say she wasn't such kind of a girl. she was.",
  "Why is being a test tube baby so great? \nYou get a womb with a view.",
  "What is old, dusty and tucked away behind the bookshelf? \nA: The 1974 hid'n seek champion!",
  "John and Tracy were in a very posh restaurant. John asked for the menu. he brought \nthe menu to them but stated \"I am not a waiter, my name is Hans and I wash the dishes for \nYosfayce (pronounced yo's face), the Russian chef\". A few minutes later, Hans came back and \nsaid \"I can't find Yosfayce or the waiter, but I will take your order\" They had decided to have \nSquid. Hans went to get the tank. John chose the Squid, and Hans removed it from the tank \nand rushed it to the kitchen. Hans returned \"I cannot kill that squid, as it has lots of little hairs \naround its mouth,I can't kill that\".John insisted that he was going to have the Squid.\"OK\" said \nHans \"I will find Yosfayce and get him to do it. He will kill anything!\"5 minutes later, Yosfayce \ncomes over to the table and says \"I can't kill the Squid, It has lots of hairs around its \nmouth\".John asked \"WHAT DOES THIS MEAN?\" The Waiter appeared, and said \"This means \nHans that do dishes can be soft as yosfayce, with mild green hairy lipped squid\"",
  "Two ladies was walking in the woods when they saw a raccoon on top of a tree stump. \nThe first lady asked, \"What do you think? Do you think it's rabid? The second lady answered, \n\"No, raccoon.\"",
  "Q: What are hippies? A: They're what leggies hang from.",
  "Golfer on Par 3 tee, large pond between tee and green. He puts an old ball on the tee. \nHears a voice:\"Use a new ball!\" The old ball is replaced with a new one,then he takes a \npractice swing. \"Use the old ball!!\"",
  "Why couldn't the Prince Potato marry the BBC correspondent? \nBecause she was a common-tater......",
  "How many boring people does it take to change a lightbulb? One.",
  "Bob recently bought a new car and is driving back home on the M1 highway. Suddenly \nthe music on the radio is interrupted and a special boradcast is heard \"This is breaking news, \nthere one car going the wrong way on the highway M1, drivers please be aware!\" Bob looks \naround and says \"One? There are hundreds!\"",
  "knock knock \nwhos there \nCanoe \nCanoe who? \nCanoe open the door plaese!",
  "What do you get when you divide the circumference of a pumpkin by its diameter? \nPumpkin pi!",
  "A man visiting a farm notices a three legged pig hobbeling around. Thinking it \nstrange such an animal should be kept on a working farm, he asked the farmer \nabout it. \n\"Son,\" said the farmer, \"that pig is a hero.\" \"There was a fire which started in",
  "so there's these two talking muffins, and they're sitting in an oven. one of them looks \nat the other and says, \"boy, it's hot in here!\" and the other one says, \"oh my god, it's a talking \nmuffin!\"",
  "The night watchman was making his rounds and was surprised that no one was in the \noffice except a big dog emptying wastebaskets. \nThe watchman stared at the animal, wondering if his imagination could be playing tricks on \nhim... \nThe dog looked up and said, \"Don't be surprised. This is just part of my job.\" \n\"Incredible!\" exclaimed the man. \"I can't believe it! Does your boss know what a prize he has \nin you? An animal that can talk!\" \n\"No, no,\" pleaded the dog. \"Please don't, If that man finds out I can talk he will make me \nanswer the phone as well!\"",
  "A man hurrying home on a cold rainy night takes a shortcut through the local cemetery \nand falls into an freshly dug, empty grave. He struggles to get out but can't climb the wet, \nslippery walls. He begins shouting for help but has little hope as the rain is making a \nthunderous noise and it is late at night. A drunk, oblivious to the weather, is wending his way \nthrough the graveyard when he hears the frantic crys. He goes to the gravesite and looks \ndown incredulously. \"Help me!\" the stranded man pleads. \"Well. what's the matter?\" the \ndrunk asks, struggling to keep his balance on the edge of the grave. \"What's the matter? Look \nat me! I'm wet and I'm freezing,\" the man shouts in exasperation. \"Well...no wonder,\" the \ndrunk replies, \"You kicked all your dirt off!\"",
  "After years of nagging, the wife was finally going deer hunting with her husband. \n\"I'll drop you off here and go park the car. Don't get into trouble,\" says her husband. \nHe drove the car down the road and parked it. Walking back he could hear a heated \nargument between his wife and some man. \n\"It's my deer. I shot it!\" he could hear his wife shouting. \nThe man's voice kept insisting... \"That's NOT your deer, lady!\" \nThe husband started walking faster. \nHis wife said \"It is TOO, my deer. I shot it and it's mine.\" \n\"No it's NOT!\" said the man. \nThe argument got louder and louder with his wife shouting about her killing her first deer. \nFinally, the weary voice of the man was heard admitting defeat, \"Okay, lady, it's YOUR deer. \nJust let me get my saddle off it...\"",
  "One woman had always wanted to take a bath in a tub filled with warm milk. So she \ncalled the dairyman out to measure the tub and find out how much milk she would need and \nhow much it would cost. He began measuring and asked her, \"Do you want it pasteurized?\" \nAnd she said, \"No, just up to my bosom would be fine.\"",
  "A man prays to god every friday: \"Oh God let me win the state lottery\" ... One day a \nvoice comes to him and says \"Come on - Give me a chance! Buy a lottery ticket!\"",
  "What did one casket say to the other? That you coughin'?",
  "On Monday a delivery van was stolen containing files and diaries. The next day \nanother van was stolen, this time containing filing cabinets. The police believe it was \norganised crime.",
  "A city feller goes to a dude ranch and arrives in the evening. Making conversation with \nthe cow-hand, he asks \"Are we going to be driving that bunch of cows over there?\" \"Herd\" is \nthe cowhand's reply. \"Heard? Heard of what?\" asks the city slicker. \"Herd of COWS\" replies \nthe cow-hand. \"'Course I've heard of cows,\" says the indignant city dweller. \"There's a bunch \nof 'em right over there!\"",
  "Three men were on a boat and they wanted a smoke. They had a packet of cigarettes, \nbut no matches. So how did they get to have their smoke? \nDon't know? \nSimple. They threw one of the cigarettes overboard and then the boat was a cigarette lighter!",
  "A magician was working on a cruise ship in the Caribbean. The audience would be \ndifferent each week, so the magician allowed himself to do the same tricks over and over \nagain. There was only one problem: The captain's parrot saw the shows each week and began \nto understand how the magician did every trick. Once he understood he started shouting in \nthe middle of the show: \"Look, it's not the same hat\" \"Look, he is hiding the flowers under the \ntable\" \"Hey, why are all the cards the Ace of Spades ?\" The magician was furious but couldn't \ndo anything; it was, after all, the captain's parrot. One day the ship had an accident and sank. \nThe magician found himself on a piece of wood in the middle of the ocean with the parrot, of \ncourse. They stared at each other with hate, but did not utter a word. This went on for a day \nand another and another. After a week the parrot said: \"OK, I give up. Where's the boat?\"",
  "A cocker spaniel limps into a bar and says to the bartender, \"I'm looking for the man \nwho shot my paw.\"",
  "A man goes to see the doctor - \nMan - Doctor, Doctor I feel like a cowboy! \nDoc - Mmmmmm, and how long have you felt this way? \nMan - about a YEEEEEEHAAAAAAA!",
  "A man in a balloon calls down to a fellow on the ground. \"Where am I?\", he asks. \n\"You're in a balloon\", the fellow replies. \"You must be a software engineer\", says the man in \nthe balloon - \"for where else could I receive such a useless, yet technically correct answer?\" \nThe fellow on the ground yells, back: \"Very good guess! I am a software engineer - you must \nbe a manager!\" The startled man in the balloon admits this is true and asks how the fellow on \nthe ground knew this. \"Because you don't know where you are, or where you are going, and \nare still in the same situation \nyou were before asking for my help - but now you've somehow managed to make it my fault\", \nthe fellow replied.",
  "A ship carrying blue paint has collided with a ship carrying red paint. \nAll passengers have been marooned.",
  "A ship carrying artificial limbs has sunk. \nAll hands are reported lost.",
  "What do you call a cow spying on another cow? A steak out.",
  "A linguistics professor was lecturing to his class one day. 'In English,' he said, 'A double \nnegative forms a positive. In some languages, though, such as Russian, a double negative is \nstill a negative. However, there is no language wherein a double positive can form a negative.' \nA voice from the back of the room piped up, 'Yeah, right.'",
  "What do you get if you cross a pit bull with a collie? A dog that will chew your leg off \nthen run for help.",
  "Bob received a parrot for his birthday. The parrot was fully grown, with a \nvery bad attitude and worse vocabulary. \nEvery other word was an expletive; those that weren't expletives were, to \nsay the least, rude. Bob tried to change the bird's attitude by constantly saying polite words, \nplaying soft \nmusic...anything he could think of. Nothing worked. \nHe yelled at the bird, and the bird got worse. He shook the bird, and the \nbird got madder and more rude. \nFinally, in a moment of desperation, Bob put the parrot in the freezer. \nFor a few moments he heard the bird swearing, squawking, kicking and \nscreaming and then, suddenly, there was absolute quiet. Bob was frightened that he might \nhave actually \nhurt the bird, and quickly opened the freezer door. \nThe parrot calmly stepped out onto Bob's extended arm and said, \"I'm sorry \nthat I offended you with my language and my actions, and I ask your forgiveness. I will \nendeavour to correct \nmy behaviour\". \nBob was astounded at the changes in the bird's attitude and was about to \nask what had changed him, when the parrot continued, \"May I ask what the Chicken \ndid?\"",
  "Q: How do mommy brooms and daddy brooms make baby brooms? \nA: They sweep together!",
  "Johnny was having trouble in math, so his parents sent him to catholic private school. \nOn the first day he came rushing back home and started working furiously on his math. He did \nthe same after supper. His mother was impressed and commented to him, \"Wow, Johnny, \nyou're really working hard!\" Johnny looked up and said, \"Well, when I went in there and saw \nthat guy nailed to the plus sign, I just knew they were'nt messing around.\"",
  "Two men on the 9th tee tire of waiting for two women to get off the fairway. One \nman approaches them but before he reaches the women he does an abrupt U turn, \nand explains to his partner that one of the women is his wife and the other is \nhis girl friend. The second man agrees to go but also does a U turn before reaching \nthe ladies and explains to his partner on returning \"Small world, isn't it!\"",
  "How many surrealists does it take to change a lightbulb? \nTwo. On to hold the giraffe and one to put the clocks in the bath tub.",
  "Q: why did the football coach go to the bank ? A: to get his quarterback!",
  "A scientist who thought he knew everything was going on a business trip. On the \nairplane, he sat next to a lady. He asked her, \"Do you want to play a game where I ask you a \nquestion and if you can't answer, you give me $5 and then you ask me a question and I give \nyou $5 if I can't answer?\" \n\"No\" \n\"How about if when I can't answer, I give you $1000, but if you can't answer, you only have to \ngive me $5?\" \n\"No\" \n\"How about if I can't answer, I give you $2000?\" \n\"OK\" \n\"What is the top speed of an Indian fruit bat?\" \nThe lady gave him $5 and asked him, \"What has 15 legs going up a hill, 137 legs at the top, and \n57 legs coming down?\" \nThe man searched in every resource he had and eventually gave up and gave the lady $2000, \nthen asked, \"What is the answer?\" \nThe lady gave him $5.",
  "A guy goes into a restaurant on Christmas morning for breakfast. The waitress serves \nhim his eggs benedict on a large and very shiny, metal plate. The guy says, what's with this \nplate? The waitress says: \"It's Christmas, and there's no plates like chrome for the \nhollandaise.\"",
  "A Victor was out playing golf with his good friend John. After a few holes John was \ngetting frustrated as he was not that good a golfer. Finally when he missed an easy putt he \nblurted out, \"Damn, I missed the bugger!\".",
  "What do otters say when they get stuck in seaweed?? \nKelp!! Kelp!!",
  "A couple is vacationing somewhere in France. One fine afternoon, they visit a historic \nchurch. They climb up to the bell tower to take a few pictures, and there they find a little \nhunch-backed man. \"Hello,\" they greet him, but he ignores them and cries: \"I must ring the \nbell!\" He then runs face first into the enormous church bell, ringing it, and then falls from the \ntower to his death below. \"Who was that?\" the man asks his wife. \"I'm not sure,\" she \nanswers, \"but his face certainly rings a bell.\" \nFollow up: The next day the couple returns to the tower. A second hunch-back, identicle to \nthe first, appears and exclaims: \"I must ring the bell!\" He runs into the bell, falls from the \ntower, and dies. \"Well, who was that?\" the man wonders, to which his wife replies: \"I don't \nknow. . . but he was a dead ringer for the other guy.\"",
  "What's the difference between a coyote and a flea? \nOne howls on the prairie, and one prowls on the hairy",
  "A man was driving a convertible with three penquins in the back seat. He stopped at a \ngas station and said to the attendant, \"I've been driving around with these penguins for days \nnow. I don't know what to do with them.\" \"Why don't you take them to the zoo?\" the \nattendant suggested. \"That's a great idea. Thanks!\" said the man. \nA week later the same guy stops at the same gas station- the penguins are still in the back \nseat. The attendant says to him, \"Hey, I thought you were going to take them to the zoo?\" \"I \ndid,\" the man replied. \"We had a blast- today we're going to the beach!\"",
  "Q: Why did the first monkey fall out of the tree? \nA: Because he was dead. \nQ: Why did the second monkey fall out of the tree? \nA: Because he was tied to the first monkey. \nQ: Why did the third monkey fall out of the tree? \nA: Monkey see, monkey do. \nQ: Why did the fourth monkey fall out of the tree? \nA: Peer pressure.",
  "An elderly couple was on a cruise and it was really stormy. They were standing on the \nback of the boat watching the moon, when a wave came up and washed the old woman \noverboard. They searched for days and couldn't find her, so the captain sent the old man back \nto shore with the promise that he would notify him as soon as they found something. Three \nweeks went by and finally the old man got a fax from the boat. It read: \"Sir, sorry to inform \nyou, we found your wife dead at the bottom of the ocean. We hauled her up to the deck",
  "Two magpies were sitting on the telegraph wires. One turned to the other and said \n\"Don't those long words tickle your bum?\"",
  "An elderly couple had dinner at another couple's house, and after eating, the wives left \nthe table and went into the kitchen. \nThe two elderly gentlemen were talking, and one said, \"Last night,we went out to a new \nrestaurant, and it was really great. I would recommend it very highly.\" \nThe other man said, \"What was the name of the restaurant?\" \nThe first man thought and thought and finally said, \"What is the name of that \nflower you give to someone you love?? You know... the one that is red and has thorns.\" \n\"Do you mean a rose?\" \n\"Yes,\" the man said. He then turned towards the kitchen and yelled, \n\"Rose, what's the name of that restaurant we went to last night?\"",
  "a dog comes into a bar and asks for a beer \nthe bartender, a little surprised serves the dog the beer \nthe dog drinks the beer and asks for the bill \n\"it'll be 10 dollars\" says the bartender \nthe dog pays and is leaving through the door when the bartender says \n\"it is not usual to have dogs here drinking\" \nthe dog hears and answers \"for 10 dollars a beer no dog can keep drinking here\"",
  "How Do You Get Holy Water? You Boil The Hell Out Of It.",
  "A wife went to the police station with her next-door neighbor to report her husband \nwas missing. The policeman asked for a description. \nShe said, \"He's 35 years old, 6 foot 4, had dark eyes, dark wavy hair, an athletic build, weighs \n185 pounds, is soft-spoken, and is good to the children.\" \nThe next-door neighbor protested, \"Your husband is 5 foot 4 inches, chubby, bald, has a big \nmouth, and is mean to your children.\" \nThe wife replied, \"Yeah, but who wants HIM back?\"",
  "Why was tigger looking in the toilet? \nto find pooh",
  "What fizzy drink does a frog drink? \nCroca cola",
  "What is the difference between a duck? \nOne of its legs are both the same!",
  "Q: What's yellow and can't waterski? \nA: A bulldozer.",
  "What do you call a dry parrot? \nPolyunsaturated",
  "The court was investigating an accident \nJudge: What gear were you in at the moment of the impact? \nA: Gucci sweats and Reeboks.",
  "Chap goes to the doctor, who examines him and says \"Hmmm, OK, go over to the \nwindow and stick your tongue out\". \"But\" protests the chap \"I've only got a sore knee!\". \"I \nknow\" says the doctor \"but I hate that bloke across the road\".",
  "What is the definition of pain? \nA one-armed man hanging off a cliff with an itchy bum.",
  "Why are girraffes necks so long? \nBecause their heads are so far away.",
  "husband tells doctor,'Doctor my wife thinks she's a four poster bed.' \ndoctor replies, 'In that case, she needs to go into care.' \nhusband responds, 'But what will I sleep on'",
  "Q. How do you know that you have slept like a log? \nA. You wake up in the fireplace.",
  "\"I dont care whose son you are. I dont want you walking on the water here where I \nam fishing and scaring the fishes away.\"",
  "Q. Why do squirrels swim on their backs? \nA. To keep their nuts dry.",
  "Stopped at a friend's house the other day and found him stalking \naround with a fly swatter. \nWhen I asked if he was getting any flies, he answered, \n\"Yeah, 3 males and 2 females\". \nCurious, I inquired as to how he could tell the difference. \nHe answered, \"3 were on a beer can and 2 were on the phone.\"",
  "man goes into a doctors surgery. Doctor, I've got a pain in my leg, \nDo you know what it could be? Gout says the doctor. Why says the patient \"I've only just \ncome in.",
  "Q: What did one chimney say to the other A: your to young to smoke",
  "It's a contest. There's three contestants. The object is they say a phrase and have to fill \nin the blank and spell the word. First contestant - \"old macdonald had a _______\" First \ncontestant says house H O U S E. Wrong!!!! \nSecond contestant \"old macdonald had a _______\". Yard Y A R D. Wrong!!!! \nThird contestant \"old macdonald had a ________\" farm, EIEIO.",
  "A dog called \"Rufus Jagger\" walks into a bank. The Teller say's \"Hello my name is Sally \nWhack, how can I help you\". The dog puts a keyring with a little toy elephant attached to it \nonto the counter and says \"I'd like a loan please\". Sally Whack, baffeled by what's happening \npicks up the keyring and calls her manager, she explains the situation and show's her \nmanager the keyring. The manager say's \"It's a nick nack Sally Whack give the dog a loan his \nold man's a rolling stone\".",
  "The preacher was wired for sound with a lapel mike, and as he preached, he moved \nbriskly about the platform, jerking the mike cord as he went. Then he moved to one side, \ngetting wound up in the cord and nearly \ntripped before jerking it again. After several circles and jerks, a little girl in the third pew \nleaned toward her mother and whispered, \"If he gets loose, will he hurt us?\"",
  "Two elderly ladies had been friends for many decades. Over the years they had shared \nall kinds of activities and adventures. Lately, their activities had been limited to meeting a few \ntimes a week to play cards. One day they were playing cards when one looked at the other \nand said, \"Now don't get mad at me.....I know we've been friends for a long time, but I just \ncan't remember your name. I've thought and thought, but I can't recall it. Please tell me what \nyour name is.\" Her friend glared at her. For at least three minutes she just looked at her. \nFinally she said, \"How soon do you need to know?\"",
  "what did one strawberry say to the other strawbery? \nif you weren't so fresh last night we wouldn't be in this jam.",
  "A couple in their sixties are walking along the beach to admire the sunset. The wife \nsees a dirty lamp, and the husband stoops down to dust it off. magically, a genie appears out \nof nowhere and thanks the couple profusely for freeing him from his imprisonment. 'as a \nreward,' the genie says, 'i'll grant you each one wish.' The wife says 'i want to sail around the \nworld. send me and my husband on a first class luxurious cruise' *POOF* she's suddenly \nholding two tickets on the finest ship around the world. the genie turns to the husband, 'and \nfor you, sir?' the husband looks at his wife, and leans in close to the genie 'i want a wife that is \nthirty years younger than me' *POOF* and he's suddenly ninety years old.",
  "One cow says to the other. \"Arn't you just so worried about the mad cow disease?\" The \nother answers \"Why should I worry? I'm not a cow, I'm a helicopter!\"",
  "Two gangsters walk into a grocery store and while they are walking through the \nVegetable aisle one gangster says to the other ,\"Hey....... look at that.....Artie-chokes, 2 for a \nDollar!!",
  "What do you call a 450-pound canary sitting in a tree? \nSir.",
  "A man left for work one Friday afternoon. But, instead of going home, he stayed out \nthe entire weekend hunting with the boys and spending his entire paycheck. When he finally \ngot home Sunday night, he was confronted by his very angry wife, and was barraged for 2 \nhours. Finally, his wife stopped nagging and simply said to him, \"How would you like it if you \ndidn't see me for 2 or 3 days?\" To which he replied, \" That would be fine with me.\" Monday \nwent by, & he didn't see his wife, Tuesday & Wednesday came and went with the same \nresults. Thursday the swelling went down just enough where he could see her a little out of \nthe corner of his left eye.",
  "Nothing succeeds like a budgie without a beak.",
  "Q: What's the difference between a monkey and a bicycle? \nA: They both climb trees except the bicycle.",
  "The old man was sitting on the bench starring at a teen-age boy with his spiked, \nyellow, red, green and orange hair. the kid says \"what's the matter old man..haven't you ever \ndone anything wild in your days??\" \"YUP, said the old man, made love to a parrot once, \nthought you might be my son!\"",
  "What do you call a man with a car on his head ? Jack",
  "A master French thief decides to pull off a huge job at the Louvre, stealing several \nvaluable paintings. However, he was stopped and arrested just a few blocks away from the \nmuseum at a gas station. When asked how he could pull off such a heist and yet get arrested \nso easily, he responded, \n\"I had no Monet to get Degas to make the Van Gogh.\"",
  "Why do mermaids wear seashells? \nBeacause B-shells are too small and D-shells are too big!",
  "A guy is waiting to cross the traffic lights as a pedestrian, when another guy comes up \nand puts his hand in his pocket. \"What do you think your doin?\" the guy asks. \"Just lookin for \na light\" the guy says. \n\"Well why don't you just ask??'\" says the first guy \n\"I don't like talkin to strangers!!'\" comes the reply.",
  "What do you get when you cross a pitt bull with lassie? A dog that bites your leg then \ngoes and gets help",
  "What time is it when an elephant sits on a lawn chair? Time to get a new lawn chair.",
  "Wanna hear a dirty joke?...Billy fell in the mud. \n...Wanna hear a clean joke?...Billy took a bath with bubbles.",
  "It's spring time and a family of moles decides it's time to come out of hibernation. The \ndaddy mole sticks his head out of the ground, smells the air and says, \"mmmm, smells like \nbacon.\" The momma mole sticks her head out, smells the air, and says, \"mmmmm, smells like \npancakes.\" The baby mole tries to stick his head out, but there isn't enough room, so he \nsmells the air and says, \"mmmm, smells like molasses.\"",
  "A bus station is where a bus stops. A train station is where a train stops. On my desk I \nhave a work station.",
  "Q: What happens if you don't pay your exorsist.A: you get repossesed",
  "Why don't gypsies play rugby? - Because they have crystal balls.",
  "What do you call a fish thats not very smart? A dumb bass",
  "did you hear about the boy whos nose grew 11inches? he thought it might turn into a \nfoot",
  "How many surrealists does it take to change a lightbulb?",
  ": 1 to change the lightbulb, and 9 to wrestle with the giant gecko in the bathroom!",
  "Why do Skoda's have rear windscreen warmers? \nTo keep your hands warm when your pushing it!",
  "What do you call a Skoda with a sunroof? \nA skip.",
  "Why do Skodas have two exhaust pipes? \nWheelbarrow.",
  "Doctor Bob had slept with one of his patients and had felt guilty all day long. \nNo matter how much he tried to forget about it, he couldn't. The guilt and sense of betrayal \nwas overwhelming. \nBut every once in a while he'd hear that soothing voice, within himself, trying to reassure him: \n\"Bob, don't worry about it. You aren't the first doctor to sleep with one of their patients... and \nyou won't be the last. And you're single. Let it go......\" \nBut invariably another voice would bring him back to reality: \"Bob, you're a vet...\"",
  "How many religious education teacher's does it take to screw in a light bulb? \nOne, and their God of choice.",
  "Why did the bird with one eye cross the road \nTo get two birdseye factory",
  "Two bugs go out of a concert. The smaller one asks: Shall we walk home or take a dog ?",
  "A guy walks out to his porch one day and sees a snail crawling across the step. He \npicks up the snail and throws it across the lawn, into the street. Two years later he hears a \nsoft knocking on the door, he goes to the door and opens it. The snail, looking up from the \nground at him, says \"Well what was *that* about?\"",
  "What do you call a sheep with no head or legs? \nA cloud.",
  "I am now on a seafood diet! \nI see food and I eat it!!",
  "So these two statues, one of a man and one of a woman, are standing in a park. Like all \ngood statues they are nude and covered in bird poop. One day an angel comes down and says \nto them \"I am going to animate you for 10 minutes and for those 10 minutes you can do \nwhatever you want, but then you have to become statues again for the rest of your lives. So \nthey both run off behind the bushes. Sounds of true enjoyment emanate from the bushes and \nthen they return about 5 minutes later. The angel asks \"Why don't you use your whole ten \nminutes?\" The woman turns to the man and says \"I guess we could do it again, but this time \nyou hold the bird's head and I'll poop on it.\"",
  "Did you hear the one about the Magician who was walking down the street when he \nturned into a Restaurant?",
  "When I die I would like to go like my grandfather - in his sleep, quietly - not hollering \nand screaming like all the other people in his car.",
  "This woman rushed to see her doctor, looking very much worried and all strung out. \nShe rattles off, \"Doctor, take a look at me. When I woke up this morning, I looked at myself in \nthe mirror and saw my hair all wiry and frazzled up, my skin was all wrinkled and pasty, my \neyes were bloodshot and bugging out, and I had this corpse-like look on my face! What's \nWRONG with me, Doctor!?\" \nThe doctor looks her over for a couple of minutes, then calmly says, \"Well, I can tell you that \nthere ain't nothing wrong with your eyesight....\"",
  "Q. What do you get when Godzilla steps on your house? \nA. Mushrooms.",
  "What is a baby bee - A little humbug",
  "Did you hear about the man who lived in a tyre? He had a puncture so now he lives in a \nflat!",
  "A man is goes to his doctor because he is not feeling well. The doctor determines his \ncondition is very serious and tells the man he does not have long to live. The man asks how \nmuch longer he has and the doctor replies \"10, 9, 8, 7, ...\"",
  "Did you hear about the cowboy who got caught shoplifting? He got two yeehars!!",
  "As a teacher I was trying to get my students to understand what a \"pun\" was. I gave \nthem 10 examples but was not successful. They could not understand any of them. You might \nsay that no pun in ten did!",
  "A pig farmer is having trouble getting his pigs to breed. So, he asks a friend what he \nthinks is wrong. The friend tells him that this happened to him once, and that the pigs don't \nknow how to breed. His friend says that when it happened to him, he had to show each pig \nwhat it was supposed to do. \nWell, the pig farmer feels pretty stupid about this, but decides to give it a try. But in order to \navoid anyone seeing this, he piles the pigs up in the truck and drives them to a hidden part of \nthe farm, way in the back. He \"teaches\" of all the pigs, which exhausts him and then hauls \nthem back to the pen. \nThe next morning he asks his wife to check if the pigs are breeding, she tell him they aren't. \nWearily, he goes out and \"teaches\" them all over again. \nThe next morning he asks his wife if they are breeding yet and she says \"No\". Frustrated and \nexhausted, he asks, \"Well, what are they doing?!?!\" To which his wife replies, \"Sitting in the \ntruck, honking the horn.\"",
  "What do you call a monkey in a minefield? A BABOON!!!!!!!!!!",
  "A man decides to take the opportunity while his wife is away to paint the toilet seat. \nAfter he finished, he went to the kitchen to raid the fridge. The wife comes home sooner than \nexpected, and heads to the bathroom, sits down and gets the toilet seat stuck to her rear. In a \npanic, she shouts to her husband to drive her to the doctor. She puts on a large overcoat to \ncover the stuck seat, and off they go. When they get to the doctors office, the man lifts his \nwifes coat to show their predicament. \nThe man asked, `Doctor, have you ever seen anything like this before?` \n`Well, yes.` the doctor replied. `But never framed.`",
  "A flash flood swept over an area, stranding a man in his house. As the water rose, a \nrescue team came by in a boat. \"Get in,\" the rescuers said. \"We'll take you to safety. \"No,\" said \nthe man. \"I have faith in the Lord. He will save me.\" \nThe rains continued and soon the man was forced up onto his roof to avoid drowning. Soon, \nanother boat came by. \"Sir, please get in,\" the rescuers in this boat said. \"The waters are \nrising. We'll take you to safety. \"No,\" said the man again. \"I have faith in the Lord. He will save \nme.\" \nThe boat left, and soon the man was barely able to keep his head above the water. The water \nbecame rougher and a helicopter was dispatched to save the man. \"We'll lower a rope. Get in \nthe copter!\" yelled the rescuers from above. \"The water shows no sign of abating. You're sure",
  "Mahatma Gandhi, as you know, walked barefoot most of the time, which produced an \nimpressive set of calluses on his feet. He also ate very little, which made him rather frail, and \nwith his odd diet, he suffered from bad breath. \nA super callused fragile mystic hexed by halitosis.",
  "A flash flood swept over an area, stranding a man in his house. As the water rose, a \nrescue team came by in a boat. \"Get in,\" the rescuers said. \"We'll take you to safety. \"No,\" said \nthe man. \"I have faith in the Lord. He will save me.\" \nThe rains continued and soon the man was forced up onto his roof to avoid drowning. Soon, \nanother boat came by. \"Sir, please get in,\" the rescuers in this boat said. \"The waters are \nrising. We'll take you to safety. \"No,\" said the man again. \"I have faith in the Lord. He will save \nme.\" \nThe boat left, and soon the man was barely able to keep his head above the water. The water \nbecame rougher and a helicopter was dispatched to save the man. \"We'll lower a rope. Get in \nthe copter!\" yelled the rescuers from above. \"The water shows no sign of abating. You're sure \nto drown!\" Once again, the man refused. \"I have faith in the Lord,\" he said calmly. \"He will \nsave me.\" \nEventually, the man did, in fact, drown. When he got to heaven, he saw the Lord and \napproached him. \"What happened?\" asked the man. I had faith that you would save me from \ndrowning. Why didn't you?\" \"Hey,\" replied the Lord. \"I sent two boats and a helicopter. What \nelse did you want?\"",
  "Q. What is Big, Red & eats Rocks? \nA. A big red rock eater!",
  "If a wheel falls off a bus while traveling down a river, how long will it take to shingle a \ndog house? None, because there's no bones in cottage cheese!",
  "Matt: I got a set of golf clubs for my wife. \nBen: Nice trade.",
  "Two guys were walking on the street when one of them says: \n\"I've realized that my wife is an angel.\" \n\"Mine isn't human, either\", said the second.",
  "Two nuns were travelling through Europe in their car. They get to \nTransylvania and are stopped at a traffic light. Suddenly, a \ndiminutive Dracula jumps onto the hood of the car and scratches \nat the windshield!",
  "Question: What is a honeymooner's sandwich? \nAnswer: Lettuce alone!",
  "What's a Grecian Urn? \nAbout 50 Drachma a day",
  "Q: Why did the Koala fall out of the tree. \nA: Because it was dead! \nQ: Why did the Kookaburra fall out of the tree \nA: Because it was hit by a falling dead Koala \nQ: Why do Kangaroo's jump \nA: To miss all the dead Koala's.",
  "Q: What can you tell when your drummer is drooling out of both sides of his mouth? \nA: The stage is level.",
  "A guy gets home from work one night and hears a voice. The voice tells him, \"Quit \nyour job, sell your house, take your money, go to Vegas.\" \nThe man is disturbed at what he hears and ignores the voice. The next day when he gets \nhome from work, the same thing happens. The \nvoice tells him, \"Quit your job, sell your house, take your money, go to Vegas.\" Again the man \nignores the voice, though he is very troubled by \nthe event. \nEvery day, day after day, the man hears the same voice when he gets home \nfrom work, \"Quit your job, sell your house, take your money, go to Vegas.\" \nEach time the man hears the voice he becomes increasingly upset. Finally, \nafter two weeks, he succumbs to the pressure. He does quit his job, sells \nhis house, takes his money and heads to Vegas. \nThe moment the man gets off the plane in Vegas, the voice tells him, \"Go \nto Harrah's.\" So, he hops in a cab and rushes over to Harrah's. As soon \nas he sets foot in the casino, the voice tells him, \"Go to the roulette",
  "How many ears did Davy Crockett have? Three. A left ear, a right ear, and a wild front \near.",
  "Where does Kylie get her keebabs from? \n....Jasons Donervan!",
  "Jesus Christ walks up to an angry mob that is stoning a harlot. He steps into the fray \nand calls out in a commanding voice: \n\"Let he who is without sin cast the first stone.\" \nShamefaced, the crowd stops and begins to slink away. Suddenly, a woman shrieks, \"Stone \nher!\", and the mob starts again with the frenzied stoning. \nChrist, chagrined, goes to the woman and says: \n\"Damn it, Mom, I hate it when you do that..\"",
  "What do you get if you lie, face down under a cow? \nAnswer: A PAT ON THE BACK!",
  "How did the elephant get on the tree? Sat on an acorn and waited for it to grow. \nHow did the elephant get off the tree? Sat on a leaf and waited till Autumn.",
  "What do you get if you lie, face down under a cow? \nAnswer: A PAT ON THE BACK!",
  "Whats a canibles favourite game? \nSwallow my leader!",
  "if a fly and a flee pass each other what time is it? \nFly past flee!",
  "Q.Why was the Egtptian girl worried? \nA.Because her Daddy was a mummy!",
  "Q : How many psychanalysts are needed to change a light bulb ? \nA : One is enough, but the bulb must want to change, and it can take years.",
  "A drummer gets fed up with all the comments denying he's a real musician, and so he \ndecides to learn some new instruments. He visits his local Music shop, and spends an hour \nlooking around and deliberating. \n\"Right!\" He says, after an age. \"I'll have the shiny red one, and the accordion thing over there\". \n\"I'll do you a deal\" ays the Music Shop Manager, \"You can but the fire extinguisher, but the \nradiator is staying where it is\".",
  "Q.When is a vet busiest? A.When its raining cats and dogs!",
  "Q) What is the difference between illegal and unlawful? \nA) One is against the law and the other is a sick bird.",
  "Q.What's the difference between a rainstorm and a lion with a toothace. \nA.One pours with rain and the other roars with pain."
]
